local CityDevelops={
['DevItem']=
{
	[1]=
	{
		['ident']=1,
		['name']="商业",
		['expr']="((0.5/10000)*{0}+1)*100",
		['tooltip']="通商收益{0}% ,征收收入{1}%",
		['expr2']="((4/10000)*{0}+1)*100",
		['max']=10000
	},
	[2]=
	{
		['ident']=2,
		['name']="出产",
		['expr']="((1.5/10000)*{0}+1)*100",
		['tooltip']="银矿和农田收益{0}%",
		['expr2']="",
		['max']=10000
	},
	[3]=
	{
		['ident']=3,
		['name']="军事",
		['expr']="((1/10000)*{0}+1)*100",
		['tooltip']="战功收益{0}%",
		['expr2']="",
		['max']=10000
	}
}}
return CityDevelops