local RandomEvents={
['Box']=
{
	[1]=
	{
		['pos_x']=2780,
		['ident']=1,
		['multiple']="600,2;300,3;60,4;40,5",
		['name']="主城宝箱1",
		['rate']=300,
		['pos_y']=1247,
		['reward']="102;10;0"
	},
	[2]=
	{
		['pos_x']=2780,
		['ident']=2,
		['multiple']="600,2;300,3;60,4;40,5",
		['name']="主城宝箱2",
		['rate']=300,
		['pos_y']=1247,
		['reward']="102;10;0"
	},
	[3]=
	{
		['pos_x']=2780,
		['ident']=3,
		['multiple']="600,2;300,3;60,4;40,5",
		['name']="主城宝箱3",
		['rate']=300,
		['pos_y']=1247,
		['reward']="102;20;0"
	},
	[4]=
	{
		['pos_x']=2780,
		['ident']=4,
		['multiple']="600,2;300,3;60,4;40,5",
		['name']="主城宝箱4",
		['rate']=300,
		['pos_y']=1247,
		['reward']="102;20;0"
	},
	[5]=
	{
		['pos_x']=2780,
		['ident']=5,
		['multiple']="600,2;300,3;60,4;40,5",
		['name']="主城宝箱5",
		['rate']=300,
		['pos_y']=1247,
		['reward']="102;20;0"
	},
	[6]=
	{
		['pos_x']=2780,
		['ident']=6,
		['multiple']="600,2;300,3;60,4;40,5",
		['name']="主城宝箱6",
		['rate']=300,
		['pos_y']=1247,
		['reward']="1;10;0"
	},
	[7]=
	{
		['pos_x']=2780,
		['ident']=7,
		['multiple']="600,2;300,3;60,4;40,5",
		['name']="主城宝箱7",
		['rate']=300,
		['pos_y']=1247,
		['reward']="1;20;0"
	},
	[8]=
	{
		['pos_x']=2780,
		['ident']=8,
		['multiple']="600,2;300,3;60,4;40,5",
		['name']="主城宝箱8",
		['rate']=300,
		['pos_y']=1247,
		['reward']="1;30;0"
	},
	[9]=
	{
		['pos_x']=2780,
		['ident']=9,
		['multiple']="600,2;300,3;60,4;40,5",
		['name']="主城宝箱9",
		['rate']=300,
		['pos_y']=1247,
		['reward']="1;30;0"
	},
	[10]=
	{
		['pos_x']=2780,
		['ident']=10,
		['multiple']="600,2;300,3;60,4;40,5",
		['name']="主城宝箱10",
		['rate']=300,
		['pos_y']=1247,
		['reward']="1;40;0"
	},
	[11]=
	{
		['pos_x']=2780,
		['ident']=11,
		['multiple']="600,2;300,3;60,4;40,5",
		['name']="主城宝箱11",
		['rate']=300,
		['pos_y']=1247,
		['reward']="5;2000;0"
	},
	[12]=
	{
		['pos_x']=2780,
		['ident']=12,
		['multiple']="600,2;300,3;60,4;40,5",
		['name']="主城宝箱12",
		['rate']=300,
		['pos_y']=1247,
		['reward']="5;2000;0"
	},
	[13]=
	{
		['pos_x']=2780,
		['ident']=13,
		['multiple']="600,2;300,3;60,4;40,5",
		['name']="主城宝箱13",
		['rate']=300,
		['pos_y']=1247,
		['reward']="5;2000;0"
	},
	[14]=
	{
		['pos_x']=2780,
		['ident']=14,
		['multiple']="600,2;300,3;60,4;40,5",
		['name']="主城宝箱14",
		['rate']=300,
		['pos_y']=1247,
		['reward']="5;3000;0"
	},
	[15]=
	{
		['pos_x']=2780,
		['ident']=15,
		['multiple']="600,2;300,3;60,4;40,5",
		['name']="主城宝箱15",
		['rate']=300,
		['pos_y']=1247,
		['reward']="5;3000;0"
	},
	[16]=
	{
		['pos_x']=2780,
		['ident']=16,
		['multiple']="600,2;300,3;60,4;40,5",
		['name']="主城宝箱16",
		['rate']=300,
		['pos_y']=1247,
		['reward']="9;2;0"
	},
	[17]=
	{
		['pos_x']=2780,
		['ident']=17,
		['multiple']="600,2;300,3;60,4;40,5",
		['name']="主城宝箱17",
		['rate']=300,
		['pos_y']=1247,
		['reward']="9;2;0"
	},
	[18]=
	{
		['pos_x']=2780,
		['ident']=18,
		['multiple']="600,2;300,3;60,4;40,5",
		['name']="主城宝箱18",
		['rate']=300,
		['pos_y']=1247,
		['reward']="9;3;0"
	},
	[19]=
	{
		['pos_x']=2780,
		['ident']=19,
		['multiple']="600,2;300,3;60,4;40,5",
		['name']="主城宝箱19",
		['rate']=300,
		['pos_y']=1247,
		['reward']="9;3;0"
	},
	[20]=
	{
		['pos_x']=2780,
		['ident']=20,
		['multiple']="600,2;300,3;60,4;40,5",
		['name']="主城宝箱20",
		['rate']=300,
		['pos_y']=1247,
		['reward']="9;3;0"
	}
},
['Trigger']=
{
	[1]=
	{
		['ident']=1,
		['name']="竞技场",
		['isMystery']=200,
		['rate']=30,
		['desc']="每次竞技场挑战次数-1可能触发",
		['type']=1,
		['moduleId']=2801
	},
	[2]=
	{
		['ident']=2,
		['name']="瑶台银阙",
		['isMystery']=200,
		['rate']=30,
		['desc']="每次瑶台银阙次数-1可能触发",
		['type']=2,
		['moduleId']=2901
	},
	[3]=
	{
		['ident']=3,
		['name']="沙场问道",
		['isMystery']=200,
		['rate']=30,
		['desc']="每次沙场问道次数-1可能触发",
		['type']=3,
		['moduleId']=2902
	},
	[4]=
	{
		['ident']=4,
		['name']="武将属性",
		['isMystery']=200,
		['rate']=30,
		['desc']="每次武将升级都可能会触发",
		['type']=4,
		['moduleId']=101
	},
	[5]=
	{
		['ident']=5,
		['name']="强化",
		['isMystery']=200,
		['rate']=30,
		['desc']="每次装备强化都可能会触发",
		['type']=5,
		['moduleId']=111
	},
	[6]=
	{
		['ident']=6,
		['name']="铸造",
		['isMystery']=200,
		['rate']=30,
		['desc']="每次装备铸造都可能会触发",
		['type']=6,
		['moduleId']=112
	},
	[7]=
	{
		['ident']=7,
		['name']="洗炼",
		['isMystery']=200,
		['rate']=30,
		['desc']="每次装备洗练都可能会触发",
		['type']=7,
		['moduleId']=113
	},
	[8]=
	{
		['ident']=8,
		['name']="征兵",
		['isMystery']=200,
		['rate']=30,
		['desc']="每次征兵都可能会触发",
		['type']=8,
		['moduleId']=701
	},
	[9]=
	{
		['ident']=9,
		['name']="义兵",
		['isMystery']=200,
		['rate']=30,
		['desc']="每次募集义兵都可能会触发",
		['type']=9,
		['moduleId']=702
	},
	[10]=
	{
		['ident']=10,
		['name']="建筑升级",
		['isMystery']=200,
		['rate']=30,
		['desc']="每次建筑升级都可能会触发",
		['type']=10,
		['moduleId']=0
	},
	[11]=
	{
		['ident']=11,
		['name']="收获",
		['isMystery']=200,
		['rate']=30,
		['desc']="每次农田收获都可能会触发",
		['type']=11,
		['moduleId']=1401
	},
	[12]=
	{
		['ident']=12,
		['name']="征收",
		['isMystery']=200,
		['rate']=30,
		['desc']="每次征收都可能会触发",
		['type']=12,
		['moduleId']=1
	},
	[13]=
	{
		['ident']=13,
		['name']="古城探秘",
		['isMystery']=200,
		['rate']=30,
		['desc']="每次古城探秘次数-1都可能会触发",
		['type']=13,
		['moduleId']=2701
	},
	[14]=
	{
		['ident']=14,
		['name']="普通副本",
		['isMystery']=200,
		['rate']=30,
		['desc']="每次挑战普通副本都可能会触发",
		['type']=14,
		['moduleId']=21
	},
	[15]=
	{
		['ident']=15,
		['name']="每日任务",
		['isMystery']=200,
		['rate']=30,
		['desc']="每次完成任意每日任务都可能会触发",
		['type']=15,
		['moduleId']=42
	},
	[16]=
	{
		['ident']=16,
		['name']="研究",
		['isMystery']=200,
		['rate']=30,
		['desc']="每次研究科技都可能会触发",
		['type']=16,
		['moduleId']=802
	},
	[17]=
	{
		['ident']=17,
		['name']="试炼塔",
		['isMystery']=200,
		['rate']=30,
		['desc']="每次挑战试练塔都可能会触发",
		['type']=17,
		['moduleId']=1501
	},
	[18]=
	{
		['ident']=18,
		['name']="酒馆",
		['isMystery']=200,
		['rate']=30,
		['desc']="每次酒馆寻访都可能会触发",
		['type']=18,
		['moduleId']=1601
	}
},
['relationship']=
{
	[1]=
	{
		['general']="20010;20011;20001",
		['ident']=1,
		['desc']="刘备、关羽、张飞义结桃园，情同手足；日后必尽心竭力，供主公驱使。",
		['type']=1,
		['title']="桃园结义"
	},
	[2]=
	{
		['general']="10001;40171",
		['ident']=2,
		['desc']="曹操忘恩负义杀吕伯奢一家，与陈宫反目成仇；今同朝为官，必生龃龉，主公建筑收益减半。",
		['type']=2,
		['title']="捉放曹"
	},
	[3]=
	{
		['general']="20012;20031",
		['ident']=3,
		['desc']="血染征袍透甲红，当阳谁敢与争锋！古来冲阵扶危主，只有常山赵子龙。子龙英勇，日后必尽心竭力，供主公驱使。",
		['type']=1,
		['title']="单骑救主"
	},
	[4]=
	{
		['general']="20012;40076",
		['ident']=4,
		['desc']="义之所至，生死相随！苍天可鉴，白马为证！子龙英勇，日后必尽心竭力，供主公驱使。",
		['type']=1,
		['title']="白马义从"
	},
	[5]=
	{
		['general']="10028;10029;10030",
		['ident']=5,
		['desc']="曹氏宗室，文武双全。三兄弟日后必尽心竭力，供主公驱使。",
		['type']=1,
		['title']="曹魏宗室"
	},
	[6]=
	{
		['general']="10001;40063",
		['ident']=6,
		['desc']="胜负之变，决于须臾，不在众寡也！曹袁反目，主公建筑收益减半。",
		['type']=2,
		['title']="官渡之争"
	},
	[7]=
	{
		['general']="30001;30005",
		['ident']=7,
		['desc']="虎父无犬子！二人日后必尽心竭力，供主公驱使。",
		['type']=1,
		['title']="江东父子"
	},
	[8]=
	{
		['general']="30001;40101",
		['ident']=8,
		['desc']="尔敢夺我玉玺！刘表不义，主公建筑收益减半。",
		['type']=2,
		['title']="将星陨落"
	},
	[9]=
	{
		['general']="30003;30031",
		['ident']=9,
		['desc']="江东后继有人啊！日后必尽心竭力，供主公驱使。",
		['type']=1,
		['title']="后起之秀"
	},
	[10]=
	{
		['general']="40029;40185",
		['ident']=10,
		['desc']="貂蝉国色，温候无双！二人日后必尽心竭力，供主公驱使。",
		['type']=1,
		['title']="英雄美人"
	}
},
['Egg']=
{
	[1]=
	{
		['pos_x']=3088,
		['ident']=1,
		['multiple']="600,2;300,4;60,8;40,10",
		['question']="有诗云：威镇乾坤第一功，辕门画鼓响咚咚。云长停盏施英勇，酒尚温时斩华雄。另有记载：坚复相收兵，合战于阳人，大破卓军，枭其都督华雄等。请问公子：华雄为何人所杀？",
		['answers']=
		{
			[1]=
			{
				['answer']="关羽",
				['explanation']="关羽(演义)",
				['ident']=1,
				['reward']="102;20;0"
			},
			[2]=
			{
				['answer']="孙坚",
				['explanation']="孙坚(正史)",
				['ident']=2,
				['reward']="102;20;0"
			}
		},
		['rate']=400,
		['pos_y']=1286
	},
	[2]=
	{
		['pos_x']=3088,
		['ident']=2,
		['multiple']="600,2;300,4;60,8;40,10",
		['question']="车胄是被谁杀死的？",
		['answers']=
		{
			[1]=
			{
				['answer']="关羽",
				['explanation']="关羽(演义)",
				['ident']=1,
				['reward']="102;20;0"
			},
			[2]=
			{
				['answer']="刘备",
				['explanation']="刘备(正史)",
				['ident']=2,
				['reward']="102;20;0"
			}
		},
		['rate']=400,
		['pos_y']=1286
	},
	[3]=
	{
		['pos_x']=3088,
		['ident']=3,
		['multiple']="600,2;300,4;60,8;40,10",
		['question']="三国时期除了魏蜀吴三国还曾有哪些政权存在？",
		['answers']=
		{
			[1]=
			{
				['answer']="交州士燮政权",
				['explanation']="士燮为军阀割据(错误)",
				['ident']=1,
				['reward']="102;10;0"
			},
			[2]=
			{
				['answer']="辽东公孙政权",
				['explanation']="公孙渊自立燕王(正确)",
				['ident']=2,
				['reward']="102;20;0"
			}
		},
		['rate']=400,
		['pos_y']=1286
	},
	[4]=
	{
		['pos_x']=3088,
		['ident']=4,
		['multiple']="600,2;300,4;60,8;40,10",
		['question']="“单刀赴会”的孤胆英雄是谁？",
		['answers']=
		{
			[1]=
			{
				['answer']="关羽",
				['explanation']="关羽(演义)",
				['ident']=1,
				['reward']="102;20;0"
			},
			[2]=
			{
				['answer']="鲁肃",
				['explanation']="鲁肃(正史)",
				['ident']=2,
				['reward']="102;20;0"
			}
		},
		['rate']=400,
		['pos_y']=1286
	},
	[5]=
	{
		['pos_x']=3088,
		['ident']=5,
		['multiple']="600,2;300,4;60,8;40,10",
		['question']="“曹冲称象”里的大象是谁送的？",
		['answers']=
		{
			[1]=
			{
				['answer']="孙权",
				['explanation']="象产自东吴孙权属地交州(正确)",
				['ident']=1,
				['reward']="102;20;0"
			},
			[2]=
			{
				['answer']="刘备",
				['explanation']="刘备(错误)",
				['ident']=2,
				['reward']="102;10;0"
			}
		},
		['rate']=400,
		['pos_y']=1286
	},
	[6]=
	{
		['pos_x']=3088,
		['ident']=6,
		['multiple']="600,2;300,4;60,8;40,10",
		['question']="怒鞭督邮的人是谁？",
		['answers']=
		{
			[1]=
			{
				['answer']="张飞",
				['explanation']="张飞(演义)",
				['ident']=1,
				['reward']="102;20;0"
			},
			[2]=
			{
				['answer']="刘备",
				['explanation']="刘备(正史)",
				['ident']=2,
				['reward']="102;20;0"
			}
		},
		['rate']=400,
		['pos_y']=1286
	},
	[7]=
	{
		['pos_x']=3088,
		['ident']=7,
		['multiple']="600,2;300,4;60,8;40,10",
		['question']="草船借箭的人是谁？",
		['answers']=
		{
			[1]=
			{
				['answer']="诸葛亮",
				['explanation']="诸葛亮(演义)",
				['ident']=1,
				['reward']="102;20;0"
			},
			[2]=
			{
				['answer']="孙权",
				['explanation']="孙权(正史)",
				['ident']=2,
				['reward']="102;20;0"
			}
		},
		['rate']=400,
		['pos_y']=1286
	},
	[8]=
	{
		['pos_x']=3088,
		['ident']=8,
		['multiple']="600,2;300,4;60,8;40,10",
		['question']="古城斩蔡阳的人是谁？",
		['answers']=
		{
			[1]=
			{
				['answer']="关羽",
				['explanation']="关羽(演义)",
				['ident']=1,
				['reward']="102;20;0"
			},
			[2]=
			{
				['answer']="刘备",
				['explanation']="刘备(正史)",
				['ident']=2,
				['reward']="102;20;0"
			}
		},
		['rate']=400,
		['pos_y']=1286
	},
	[9]=
	{
		['pos_x']=3088,
		['ident']=9,
		['multiple']="600,2;300,4;60,8;40,10",
		['question']="火烧博望坡的人是谁？",
		['answers']=
		{
			[1]=
			{
				['answer']="诸葛亮",
				['explanation']="诸葛亮(演义)",
				['ident']=1,
				['reward']="102;20;0"
			},
			[2]=
			{
				['answer']="刘备",
				['explanation']="刘备(正史)",
				['ident']=2,
				['reward']="102;20;0"
			}
		},
		['rate']=400,
		['pos_y']=1286
	},
	[10]=
	{
		['pos_x']=3088,
		['ident']=10,
		['multiple']="600,2;300,4;60,8;40,10",
		['question']="杨修被杀的时候是多少岁？",
		['answers']=
		{
			[1]=
			{
				['answer']="34岁",
				['explanation']="34岁(演义)",
				['ident']=1,
				['reward']="102;20;0"
			},
			[2]=
			{
				['answer']="45岁",
				['explanation']="45岁(正史)",
				['ident']=2,
				['reward']="102;20;0"
			}
		},
		['rate']=400,
		['pos_y']=1286
	},
	[11]=
	{
		['pos_x']=3088,
		['ident']=11,
		['multiple']="600,2;300,4;60,8;40,10",
		['question']="《三国演义》开篇词“滚滚长江东逝水，浪花淘尽英雄”是谁所作？",
		['answers']=
		{
			[1]=
			{
				['answer']="杨慎",
				['explanation']="明人杨慎著《临江仙》(正确)",
				['ident']=1,
				['reward']="102;20;0"
			},
			[2]=
			{
				['answer']="罗贯中",
				['explanation']="罗贯中著《三国演义》(错误)",
				['ident']=2,
				['reward']="102;10;0"
			}
		},
		['rate']=400,
		['pos_y']=1286
	},
	[12]=
	{
		['pos_x']=3088,
		['ident']=12,
		['multiple']="600,2;300,4;60,8;40,10",
		['question']="东汉末年著名的“十常侍”一共有几个人？",
		['answers']=
		{
			[1]=
			{
				['answer']="10人",
				['explanation']="10人(错误)",
				['ident']=1,
				['reward']="102;10;0"
			},
			[2]=
			{
				['answer']="12人",
				['explanation']="12人(正确)",
				['ident']=2,
				['reward']="102;20;0"
			}
		},
		['rate']=400,
		['pos_y']=1286
	},
	[13]=
	{
		['pos_x']=3088,
		['ident']=13,
		['multiple']="600,2;300,4;60,8;40,10",
		['question']="诸葛亮挥泪斩马谡是在第几次北伐？",
		['answers']=
		{
			[1]=
			{
				['answer']="第一次",
				['explanation']="第一次(正确)",
				['ident']=1,
				['reward']="102;20;0"
			},
			[2]=
			{
				['answer']="第五次",
				['explanation']="第五次(错误)",
				['ident']=2,
				['reward']="102;10;0"
			}
		},
		['rate']=400,
		['pos_y']=1286
	},
	[14]=
	{
		['pos_x']=3088,
		['ident']=14,
		['multiple']="600,2;300,4;60,8;40,10",
		['question']="马谡因违抗军令失街亭，他的死因究竟是什么？",
		['answers']=
		{
			[1]=
			{
				['answer']="被诸葛亮军前处斩",
				['explanation']="被诸葛亮军前处斩(演义)",
				['ident']=1,
				['reward']="102;10;0"
			},
			[2]=
			{
				['answer']="越狱被捉回死于狱中",
				['explanation']="越狱被捉回死于狱中(正史)",
				['ident']=2,
				['reward']="102;20;0"
			}
		},
		['rate']=400,
		['pos_y']=1286
	},
	[15]=
	{
		['pos_x']=3088,
		['ident']=15,
		['multiple']="600,2;300,4;60,8;40,10",
		['question']="曹操很喜欢小儿子曹冲，曾经想要将传位于他。但这个有着“曹冲称象”传说的聪慧少年年仅十三岁就过世了。试问，他是怎么死的？",
		['answers']=
		{
			[1]=
			{
				['answer']="病死",
				['explanation']="病死(正确)",
				['ident']=1,
				['reward']="102;20;0"
			},
			[2]=
			{
				['answer']="被曹丕所杀",
				['explanation']="被曹丕所杀(错误)",
				['ident']=2,
				['reward']="102;10;0"
			}
		},
		['rate']=400,
		['pos_y']=1286
	},
	[16]=
	{
		['pos_x']=3088,
		['ident']=16,
		['multiple']="600,2;300,4;60,8;40,10",
		['question']="汉末三国时期群雄中最先僭号称王的人是谁？",
		['answers']=
		{
			[1]=
			{
				['answer']="袁术",
				['explanation']="袁术(错误)",
				['ident']=1,
				['reward']="102;10;0"
			},
			[2]=
			{
				['answer']="宋建",
				['explanation']="宋建自称河首平汉王(正确)",
				['ident']=2,
				['reward']="102;20;0"
			}
		},
		['rate']=400,
		['pos_y']=1286
	},
	[17]=
	{
		['pos_x']=3088,
		['ident']=17,
		['multiple']="600,2;300,4;60,8;40,10",
		['question']="斩颜良诛文丑的人是谁？",
		['answers']=
		{
			[1]=
			{
				['answer']="关羽",
				['explanation']="关羽(演义)",
				['ident']=1,
				['reward']="102;10;0"
			},
			[2]=
			{
				['answer']="关羽和徐晃",
				['explanation']="关羽和徐晃(正史)",
				['ident']=2,
				['reward']="102;20;0"
			}
		},
		['rate']=400,
		['pos_y']=1286
	},
	[18]=
	{
		['pos_x']=3088,
		['ident']=18,
		['multiple']="600,2;300,4;60,8;40,10",
		['question']="在虎牢关之战击退吕布的人是谁？",
		['answers']=
		{
			[1]=
			{
				['answer']="刘关张",
				['explanation']="刘关张(正确)",
				['ident']=1,
				['reward']="102;20;0"
			},
			[2]=
			{
				['answer']="孙坚",
				['explanation']="孙坚(错误)",
				['ident']=2,
				['reward']="102;10;0"
			}
		},
		['rate']=400,
		['pos_y']=1286
	},
	[19]=
	{
		['pos_x']=3088,
		['ident']=19,
		['multiple']="600,2;300,4;60,8;40,10",
		['question']="历史上，刘备入川，说服刘璋投降的人，与邓艾入川，说服刘禅投降的人是同一个人。他是谁？",
		['answers']=
		{
			[1]=
			{
				['answer']="谯周",
				['explanation']="谯周(正确)",
				['ident']=1,
				['reward']="102;20;0"
			},
			[2]=
			{
				['answer']="张松",
				['explanation']="张松(错误)",
				['ident']=2,
				['reward']="102;10;0"
			}
		},
		['rate']=400,
		['pos_y']=1286
	},
	[20]=
	{
		['pos_x']=3088,
		['ident']=20,
		['multiple']="600,2;300,4;60,8;40,10",
		['question']="有一座三国时期的城池，至今依然保存完好。在三国演义中，有许多战役都是发生在这里。它是？",
		['answers']=
		{
			[1]=
			{
				['answer']="阳平关",
				['explanation']="阳平关(错误)",
				['ident']=1,
				['reward']="102;10;0"
			},
			[2]=
			{
				['answer']="葭萌关",
				['explanation']="葭萌关(正确)",
				['ident']=2,
				['reward']="102;20;0"
			}
		},
		['rate']=400,
		['pos_y']=1286
	},
	[21]=
	{
		['pos_x']=3088,
		['ident']=21,
		['multiple']="600,2;300,4;60,8;40,10",
		['question']="历史上，有一人曾取得了三国时期唯一一场守城方得不到援军增援、却能让攻击方主动撤退的守城战的胜利。他是谁？",
		['answers']=
		{
			[1]=
			{
				['answer']="吕蒙",
				['explanation']="吕蒙(错误)",
				['ident']=1,
				['reward']="102;10;0"
			},
			[2]=
			{
				['answer']="朱然",
				['explanation']="朱然指挥的江陵保卫战(正确)",
				['ident']=2,
				['reward']="102;20;0"
			}
		},
		['rate']=400,
		['pos_y']=1286
	},
	[22]=
	{
		['pos_x']=3088,
		['ident']=22,
		['multiple']="600,2;300,4;60,8;40,10",
		['question']="三国时期有一位名人的业余爱好是搞美食。他甚至还写过一本美食书籍《四时食制》，告诉大家哪里有美食，什么时候最好吃。这个人是？",
		['answers']=
		{
			[1]=
			{
				['answer']="陈登",
				['explanation']="陈登(错误)",
				['ident']=1,
				['reward']="102;10;0"
			},
			[2]=
			{
				['answer']="曹操",
				['explanation']="曹操(正确)",
				['ident']=2,
				['reward']="102;20;0"
			}
		},
		['rate']=400,
		['pos_y']=1286
	},
	[23]=
	{
		['pos_x']=3088,
		['ident']=23,
		['multiple']="600,2;300,4;60,8;40,10",
		['question']="不少中国人喜欢取一个外国名字，表示自己有文化。在三国时期，一个跟曹操是同乡的名人就给自己取了一个外国名字，还是梵文。这个人是？",
		['answers']=
		{
			[1]=
			{
				['answer']="祝融",
				['explanation']="祝融(错误)",
				['ident']=1,
				['reward']="102;10;0"
			},
			[2]=
			{
				['answer']="华佗",
				['explanation']="华佗(正确)",
				['ident']=2,
				['reward']="102;20;0"
			}
		},
		['rate']=400,
		['pos_y']=1286
	},
	[24]=
	{
		['pos_x']=3088,
		['ident']=24,
		['multiple']="600,2;300,4;60,8;40,10",
		['question']="历史上第一个担任军师祭酒这个官职的人是谁？",
		['answers']=
		{
			[1]=
			{
				['answer']="程昱",
				['explanation']="程昱(错误)",
				['ident']=1,
				['reward']="102;10;0"
			},
			[2]=
			{
				['answer']="郭嘉",
				['explanation']="郭嘉(正确)",
				['ident']=2,
				['reward']="102;20;0"
			}
		},
		['rate']=400,
		['pos_y']=1286
	},
	[25]=
	{
		['pos_x']=3088,
		['ident']=25,
		['multiple']="600,2;300,4;60,8;40,10",
		['question']="汉末三国时期有一个极为低调的军阀，曾割据两广、越南近40年之久，死后被越南尊为圣王，直至今天依然被越南人称颂。这个人是？",
		['answers']=
		{
			[1]=
			{
				['answer']="公孙瓒",
				['explanation']="公孙瓒(错误)",
				['ident']=1,
				['reward']="102;10;0"
			},
			[2]=
			{
				['answer']="士燮",
				['explanation']="士燮(正确)",
				['ident']=2,
				['reward']="102;20;0"
			}
		},
		['rate']=400,
		['pos_y']=1286
	},
	[26]=
	{
		['pos_x']=3088,
		['ident']=26,
		['multiple']="600,2;300,4;60,8;40,10",
		['question']="三国时期，有一人完整的见证了刘备从布衣崛起，到称帝建国，再到蜀汉灭亡的人。他是？",
		['answers']=
		{
			[1]=
			{
				['answer']="简雍",
				['explanation']="简雍(错误)",
				['ident']=1,
				['reward']="102;10;0"
			},
			[2]=
			{
				['answer']="廖化",
				['explanation']="廖化(正确)",
				['ident']=2,
				['reward']="102;20;0"
			}
		},
		['rate']=400,
		['pos_y']=1286
	},
	[27]=
	{
		['pos_x']=3088,
		['ident']=27,
		['multiple']="600,2;300,4;60,8;40,10",
		['question']="猜歇后语：许褚战马超——",
		['answers']=
		{
			[1]=
			{
				['answer']="强人所难",
				['explanation']="强人所难(错误)",
				['ident']=1,
				['reward']="102;10;0"
			},
			[2]=
			{
				['answer']="赤膊上阵",
				['explanation']="赤膊上阵(正确)",
				['ident']=2,
				['reward']="102;20;0"
			}
		},
		['rate']=400,
		['pos_y']=1286
	},
	[28]=
	{
		['pos_x']=3088,
		['ident']=28,
		['multiple']="600,2;300,4;60,8;40,10",
		['question']="第一个被授予武卫将军称号的人是谁？",
		['answers']=
		{
			[1]=
			{
				['answer']="典韦",
				['explanation']="典韦(错误)",
				['ident']=1,
				['reward']="102;10;0"
			},
			[2]=
			{
				['answer']="许褚",
				['explanation']="许褚(正确)",
				['ident']=2,
				['reward']="102;20;0"
			}
		},
		['rate']=400,
		['pos_y']=1286
	}
},
['reward']=
{
	[1]=
	{
		['allReward']=
		{

			{
				['Reward']="106;5000;0",
				['level']=1
			},

			{
				['Reward']="106;6000;0",
				['level']=2
			},

			{
				['Reward']="106;6000;0",
				['level']=3
			},

			{
				['Reward']="106;6000;0",
				['level']=4
			},

			{
				['Reward']="106;6000;0",
				['level']=5
			},

			{
				['Reward']="106;6000;0",
				['level']=6
			},

			{
				['Reward']="106;6000;0",
				['level']=7
			},

			{
				['Reward']="106;6000;0",
				['level']=8
			},

			{
				['Reward']="106;6000;0",
				['level']=9
			},

			{
				['Reward']="106;6000;0",
				['level']=10
			},

			{
				['Reward']="106;6000;0",
				['level']=11
			},

			{
				['Reward']="106;6000;0",
				['level']=12
			},

			{
				['Reward']="106;6000;0",
				['level']=13
			},

			{
				['Reward']="106;6000;0",
				['level']=14
			},

			{
				['Reward']="106;6000;0",
				['level']=15
			},

			{
				['Reward']="106;6000;0",
				['level']=16
			},

			{
				['Reward']="106;6000;0",
				['level']=17
			},

			{
				['Reward']="106;6000;0",
				['level']=18
			},

			{
				['Reward']="106;6000;0",
				['level']=19
			},

			{
				['Reward']="106;6000;0",
				['level']=20
			},

			{
				['Reward']="106;6000;0",
				['level']=21
			},

			{
				['Reward']="106;6000;0",
				['level']=22
			},

			{
				['Reward']="106;6000;0",
				['level']=23
			},

			{
				['Reward']="106;6000;0",
				['level']=24
			},

			{
				['Reward']="106;6000;0",
				['level']=25
			},

			{
				['Reward']="106;6000;0",
				['level']=26
			},

			{
				['Reward']="106;6000;0",
				['level']=27
			},

			{
				['Reward']="106;6000;0",
				['level']=28
			},

			{
				['Reward']="106;6000;0",
				['level']=29
			},

			{
				['Reward']="106;6000;0",
				['level']=30
			},

			{
				['Reward']="106;6000;0",
				['level']=31
			},

			{
				['Reward']="106;6000;0",
				['level']=32
			},

			{
				['Reward']="106;6000;0",
				['level']=33
			},

			{
				['Reward']="106;6000;0",
				['level']=34
			},

			{
				['Reward']="106;6000;0",
				['level']=35
			},

			{
				['Reward']="106;6000;0",
				['level']=36
			},

			{
				['Reward']="106;6000;0",
				['level']=37
			},

			{
				['Reward']="106;6000;0",
				['level']=38
			},

			{
				['Reward']="106;6000;0",
				['level']=39
			},

			{
				['Reward']="106;6000;0",
				['level']=40
			},

			{
				['Reward']="106;6000;0",
				['level']=41
			},

			{
				['Reward']="106;6000;0",
				['level']=42
			},

			{
				['Reward']="106;6000;0",
				['level']=43
			},

			{
				['Reward']="106;6000;0",
				['level']=44
			},

			{
				['Reward']="106;6000;0",
				['level']=45
			},

			{
				['Reward']="106;6000;0",
				['level']=46
			},

			{
				['Reward']="106;6000;0",
				['level']=47
			},

			{
				['Reward']="106;6000;0",
				['level']=48
			},

			{
				['Reward']="106;6000;0",
				['level']=49
			},

			{
				['Reward']="106;6000;0",
				['level']=50
			},

			{
				['Reward']="106;6000;0",
				['level']=51
			},

			{
				['Reward']="106;6000;0",
				['level']=52
			},

			{
				['Reward']="106;6000;0",
				['level']=53
			},

			{
				['Reward']="106;6000;0",
				['level']=54
			},

			{
				['Reward']="106;6000;0",
				['level']=55
			},

			{
				['Reward']="106;6000;0",
				['level']=56
			},

			{
				['Reward']="106;6000;0",
				['level']=57
			},

			{
				['Reward']="106;6000;0",
				['level']=58
			},

			{
				['Reward']="106;6000;0",
				['level']=59
			},

			{
				['Reward']="106;6000;0",
				['level']=60
			},

			{
				['Reward']="106;6000;0",
				['level']=61
			},

			{
				['Reward']="106;6000;0",
				['level']=62
			},

			{
				['Reward']="106;6000;0",
				['level']=63
			},

			{
				['Reward']="106;6000;0",
				['level']=64
			},

			{
				['Reward']="106;6000;0",
				['level']=65
			},

			{
				['Reward']="106;6000;0",
				['level']=66
			},

			{
				['Reward']="106;6000;0",
				['level']=67
			},

			{
				['Reward']="106;6000;0",
				['level']=68
			},

			{
				['Reward']="106;6000;0",
				['level']=69
			},

			{
				['Reward']="106;6000;0",
				['level']=70
			},

			{
				['Reward']="106;6000;0",
				['level']=71
			},

			{
				['Reward']="106;6000;0",
				['level']=72
			},

			{
				['Reward']="106;6000;0",
				['level']=73
			},

			{
				['Reward']="106;6000;0",
				['level']=74
			},

			{
				['Reward']="106;6000;0",
				['level']=75
			},

			{
				['Reward']="106;6000;0",
				['level']=76
			},

			{
				['Reward']="106;6000;0",
				['level']=77
			},

			{
				['Reward']="106;6000;0",
				['level']=78
			},

			{
				['Reward']="106;6000;0",
				['level']=79
			},

			{
				['Reward']="106;6000;0",
				['level']=80
			},

			{
				['Reward']="106;6000;0",
				['level']=81
			},

			{
				['Reward']="106;6000;0",
				['level']=82
			},

			{
				['Reward']="106;6000;0",
				['level']=83
			},

			{
				['Reward']="106;6000;0",
				['level']=84
			},

			{
				['Reward']="106;6000;0",
				['level']=85
			},

			{
				['Reward']="106;6000;0",
				['level']=86
			},

			{
				['Reward']="106;6000;0",
				['level']=87
			},

			{
				['Reward']="106;6000;0",
				['level']=88
			},

			{
				['Reward']="106;6000;0",
				['level']=89
			},

			{
				['Reward']="106;6000;0",
				['level']=90
			},

			{
				['Reward']="106;6000;0",
				['level']=91
			},

			{
				['Reward']="106;6000;0",
				['level']=92
			},

			{
				['Reward']="106;6000;0",
				['level']=93
			},

			{
				['Reward']="106;6000;0",
				['level']=94
			},

			{
				['Reward']="106;6000;0",
				['level']=95
			},

			{
				['Reward']="106;6000;0",
				['level']=96
			},

			{
				['Reward']="106;6000;0",
				['level']=97
			},

			{
				['Reward']="106;6000;0",
				['level']=98
			},

			{
				['Reward']="106;6000;0",
				['level']=99
			},

			{
				['Reward']="106;6000;0",
				['level']=100
			},

			{
				['Reward']="106;6000;0",
				['level']=101
			},

			{
				['Reward']="106;6000;0",
				['level']=102
			},

			{
				['Reward']="106;6000;0",
				['level']=103
			},

			{
				['Reward']="106;6000;0",
				['level']=104
			},

			{
				['Reward']="106;6000;0",
				['level']=105
			},

			{
				['Reward']="106;6000;0",
				['level']=106
			},

			{
				['Reward']="106;6000;0",
				['level']=107
			},

			{
				['Reward']="106;6000;0",
				['level']=108
			},

			{
				['Reward']="106;6000;0",
				['level']=109
			},

			{
				['Reward']="106;6000;0",
				['level']=110
			},

			{
				['Reward']="106;6000;0",
				['level']=111
			},

			{
				['Reward']="106;6000;0",
				['level']=112
			},

			{
				['Reward']="106;6000;0",
				['level']=113
			},

			{
				['Reward']="106;6000;0",
				['level']=114
			},

			{
				['Reward']="106;6000;0",
				['level']=115
			},

			{
				['Reward']="106;6000;0",
				['level']=116
			},

			{
				['Reward']="106;6000;0",
				['level']=117
			},

			{
				['Reward']="106;6000;0",
				['level']=118
			},

			{
				['Reward']="106;6000;0",
				['level']=119
			},

			{
				['Reward']="106;6000;0",
				['level']=120
			},

			{
				['Reward']="106;6000;0",
				['level']=121
			},

			{
				['Reward']="106;6000;0",
				['level']=122
			},

			{
				['Reward']="106;6000;0",
				['level']=123
			},

			{
				['Reward']="106;6000;0",
				['level']=124
			},

			{
				['Reward']="106;6000;0",
				['level']=125
			},

			{
				['Reward']="106;6000;0",
				['level']=126
			},

			{
				['Reward']="106;6000;0",
				['level']=127
			},

			{
				['Reward']="106;6000;0",
				['level']=128
			},

			{
				['Reward']="106;6000;0",
				['level']=129
			},

			{
				['Reward']="106;6000;0",
				['level']=130
			},

			{
				['Reward']="106;6000;0",
				['level']=131
			},

			{
				['Reward']="106;6000;0",
				['level']=132
			},

			{
				['Reward']="106;6000;0",
				['level']=133
			},

			{
				['Reward']="106;6000;0",
				['level']=134
			},

			{
				['Reward']="106;6000;0",
				['level']=135
			},

			{
				['Reward']="106;6000;0",
				['level']=136
			},

			{
				['Reward']="106;6000;0",
				['level']=137
			},

			{
				['Reward']="106;6000;0",
				['level']=138
			},

			{
				['Reward']="106;6000;0",
				['level']=139
			},

			{
				['Reward']="106;6000;0",
				['level']=140
			},

			{
				['Reward']="106;6000;0",
				['level']=141
			},

			{
				['Reward']="106;6000;0",
				['level']=142
			},

			{
				['Reward']="106;6000;0",
				['level']=143
			},

			{
				['Reward']="106;6000;0",
				['level']=144
			},

			{
				['Reward']="106;6000;0",
				['level']=145
			},

			{
				['Reward']="106;6000;0",
				['level']=146
			},

			{
				['Reward']="106;6000;0",
				['level']=147
			},

			{
				['Reward']="106;6000;0",
				['level']=148
			},

			{
				['Reward']="106;6000;0",
				['level']=149
			},

			{
				['Reward']="106;6000;0",
				['level']=150
			},

			{
				['Reward']="106;6000;0",
				['level']=151
			},

			{
				['Reward']="106;6000;0",
				['level']=152
			},

			{
				['Reward']="106;6000;0",
				['level']=153
			},

			{
				['Reward']="106;6000;0",
				['level']=154
			},

			{
				['Reward']="106;6000;0",
				['level']=155
			},

			{
				['Reward']="106;6000;0",
				['level']=156
			},

			{
				['Reward']="106;6000;0",
				['level']=157
			},

			{
				['Reward']="106;6000;0",
				['level']=158
			},

			{
				['Reward']="106;6000;0",
				['level']=159
			},

			{
				['Reward']="106;6000;0",
				['level']=160
			},

			{
				['Reward']="106;6000;0",
				['level']=161
			},

			{
				['Reward']="106;6000;0",
				['level']=162
			},

			{
				['Reward']="106;6000;0",
				['level']=163
			},

			{
				['Reward']="106;6000;0",
				['level']=164
			},

			{
				['Reward']="106;6000;0",
				['level']=165
			},

			{
				['Reward']="106;6000;0",
				['level']=166
			},

			{
				['Reward']="106;6000;0",
				['level']=167
			},

			{
				['Reward']="106;6000;0",
				['level']=168
			},

			{
				['Reward']="106;6000;0",
				['level']=169
			},

			{
				['Reward']="106;6000;0",
				['level']=170
			},

			{
				['Reward']="106;6000;0",
				['level']=171
			},

			{
				['Reward']="106;6000;0",
				['level']=172
			},

			{
				['Reward']="106;6000;0",
				['level']=173
			},

			{
				['Reward']="106;6000;0",
				['level']=174
			},

			{
				['Reward']="106;6000;0",
				['level']=175
			},

			{
				['Reward']="106;6000;0",
				['level']=176
			},

			{
				['Reward']="106;6000;0",
				['level']=177
			},

			{
				['Reward']="106;6000;0",
				['level']=178
			},

			{
				['Reward']="106;6000;0",
				['level']=179
			},

			{
				['Reward']="106;6000;0",
				['level']=180
			},

			{
				['Reward']="106;6000;0",
				['level']=181
			},

			{
				['Reward']="106;6000;0",
				['level']=182
			},

			{
				['Reward']="106;6000;0",
				['level']=183
			},

			{
				['Reward']="106;6000;0",
				['level']=184
			},

			{
				['Reward']="106;6000;0",
				['level']=185
			},

			{
				['Reward']="106;6000;0",
				['level']=186
			},

			{
				['Reward']="106;6000;0",
				['level']=187
			},

			{
				['Reward']="106;6000;0",
				['level']=188
			},

			{
				['Reward']="106;6000;0",
				['level']=189
			},

			{
				['Reward']="106;6000;0",
				['level']=190
			},

			{
				['Reward']="106;6000;0",
				['level']=191
			},

			{
				['Reward']="106;6000;0",
				['level']=192
			},

			{
				['Reward']="106;6000;0",
				['level']=193
			},

			{
				['Reward']="106;6000;0",
				['level']=194
			},

			{
				['Reward']="106;6000;0",
				['level']=195
			},

			{
				['Reward']="106;6000;0",
				['level']=196
			},

			{
				['Reward']="106;6000;0",
				['level']=197
			},

			{
				['Reward']="106;6000;0",
				['level']=198
			},

			{
				['Reward']="106;6000;0",
				['level']=199
			},

			{
				['Reward']="106;6000;0",
				['level']=200
			},

			{
				['Reward']="106;6000;0",
				['level']=201
			},

			{
				['Reward']="106;6000;0",
				['level']=202
			},

			{
				['Reward']="106;6000;0",
				['level']=203
			},

			{
				['Reward']="106;6000;0",
				['level']=204
			},

			{
				['Reward']="106;6000;0",
				['level']=205
			},

			{
				['Reward']="106;6000;0",
				['level']=206
			},

			{
				['Reward']="106;6000;0",
				['level']=207
			},

			{
				['Reward']="106;6000;0",
				['level']=208
			},

			{
				['Reward']="106;6000;0",
				['level']=209
			},

			{
				['Reward']="106;6000;0",
				['level']=210
			},

			{
				['Reward']="106;6000;0",
				['level']=211
			},

			{
				['Reward']="106;6000;0",
				['level']=212
			},

			{
				['Reward']="106;6000;0",
				['level']=213
			},

			{
				['Reward']="106;6000;0",
				['level']=214
			},

			{
				['Reward']="106;6000;0",
				['level']=215
			},

			{
				['Reward']="106;6000;0",
				['level']=216
			},

			{
				['Reward']="106;6000;0",
				['level']=217
			},

			{
				['Reward']="106;6000;0",
				['level']=218
			},

			{
				['Reward']="106;6000;0",
				['level']=219
			},

			{
				['Reward']="106;6000;0",
				['level']=220
			},

			{
				['Reward']="106;6000;0",
				['level']=221
			},

			{
				['Reward']="106;6000;0",
				['level']=222
			},

			{
				['Reward']="106;6000;0",
				['level']=223
			},

			{
				['Reward']="106;6000;0",
				['level']=224
			},

			{
				['Reward']="106;6000;0",
				['level']=225
			},

			{
				['Reward']="106;6000;0",
				['level']=226
			},

			{
				['Reward']="106;6000;0",
				['level']=227
			},

			{
				['Reward']="106;6000;0",
				['level']=228
			},

			{
				['Reward']="106;6000;0",
				['level']=229
			},

			{
				['Reward']="106;6000;0",
				['level']=230
			},

			{
				['Reward']="106;6000;0",
				['level']=231
			},

			{
				['Reward']="106;6000;0",
				['level']=232
			},

			{
				['Reward']="106;6000;0",
				['level']=233
			},

			{
				['Reward']="106;6000;0",
				['level']=234
			},

			{
				['Reward']="106;6000;0",
				['level']=235
			},

			{
				['Reward']="106;6000;0",
				['level']=236
			},

			{
				['Reward']="106;6000;0",
				['level']=237
			},

			{
				['Reward']="106;6000;0",
				['level']=238
			},

			{
				['Reward']="106;6000;0",
				['level']=239
			},

			{
				['Reward']="106;6000;0",
				['level']=240
			},

			{
				['Reward']="106;6000;0",
				['level']=241
			},

			{
				['Reward']="106;6000;0",
				['level']=242
			},

			{
				['Reward']="106;6000;0",
				['level']=243
			},

			{
				['Reward']="106;6000;0",
				['level']=244
			},

			{
				['Reward']="106;6000;0",
				['level']=245
			},

			{
				['Reward']="106;6000;0",
				['level']=246
			},

			{
				['Reward']="106;6000;0",
				['level']=247
			},

			{
				['Reward']="106;6000;0",
				['level']=248
			},

			{
				['Reward']="106;6000;0",
				['level']=249
			},

			{
				['Reward']="106;6000;0",
				['level']=250
			},

			{
				['Reward']="106;6000;0",
				['level']=251
			},

			{
				['Reward']="106;6000;0",
				['level']=252
			},

			{
				['Reward']="106;6000;0",
				['level']=253
			},

			{
				['Reward']="106;6000;0",
				['level']=254
			},

			{
				['Reward']="106;6000;0",
				['level']=255
			},

			{
				['Reward']="106;6000;0",
				['level']=256
			},

			{
				['Reward']="106;6000;0",
				['level']=257
			},

			{
				['Reward']="106;6000;0",
				['level']=258
			},

			{
				['Reward']="106;6000;0",
				['level']=259
			},

			{
				['Reward']="106;6000;0",
				['level']=260
			},

			{
				['Reward']="106;6000;0",
				['level']=261
			},

			{
				['Reward']="106;6000;0",
				['level']=262
			},

			{
				['Reward']="106;6000;0",
				['level']=263
			},

			{
				['Reward']="106;6000;0",
				['level']=264
			},

			{
				['Reward']="106;6000;0",
				['level']=265
			},

			{
				['Reward']="106;6000;0",
				['level']=266
			},

			{
				['Reward']="106;6000;0",
				['level']=267
			},

			{
				['Reward']="106;6000;0",
				['level']=268
			},

			{
				['Reward']="106;6000;0",
				['level']=269
			},

			{
				['Reward']="106;6000;0",
				['level']=270
			}
		},
		['ident']=1,
		['castleMapType']=1,
		['name']="军营"
	},
	[2]=
	{
		['allReward']=
		{

			{
				['Reward']="3;100;0",
				['level']=1
			},

			{
				['Reward']="3;100;0",
				['level']=2
			},

			{
				['Reward']="3;100;0",
				['level']=3
			},

			{
				['Reward']="3;100;0",
				['level']=4
			},

			{
				['Reward']="3;100;0",
				['level']=5
			},

			{
				['Reward']="3;100;0",
				['level']=6
			},

			{
				['Reward']="3;100;0",
				['level']=7
			},

			{
				['Reward']="3;100;0",
				['level']=8
			},

			{
				['Reward']="3;100;0",
				['level']=9
			},

			{
				['Reward']="3;100;0",
				['level']=10
			},

			{
				['Reward']="3;100;0",
				['level']=11
			},

			{
				['Reward']="3;100;0",
				['level']=12
			},

			{
				['Reward']="3;100;0",
				['level']=13
			},

			{
				['Reward']="3;100;0",
				['level']=14
			},

			{
				['Reward']="3;100;0",
				['level']=15
			},

			{
				['Reward']="3;100;0",
				['level']=16
			},

			{
				['Reward']="3;100;0",
				['level']=17
			},

			{
				['Reward']="3;100;0",
				['level']=18
			},

			{
				['Reward']="3;100;0",
				['level']=19
			},

			{
				['Reward']="3;100;0",
				['level']=20
			},

			{
				['Reward']="3;100;0",
				['level']=21
			},

			{
				['Reward']="3;100;0",
				['level']=22
			},

			{
				['Reward']="3;100;0",
				['level']=23
			},

			{
				['Reward']="3;100;0",
				['level']=24
			},

			{
				['Reward']="3;100;0",
				['level']=25
			},

			{
				['Reward']="3;100;0",
				['level']=26
			},

			{
				['Reward']="3;100;0",
				['level']=27
			},

			{
				['Reward']="3;100;0",
				['level']=28
			},

			{
				['Reward']="3;100;0",
				['level']=29
			},

			{
				['Reward']="3;100;0",
				['level']=30
			}
		},
		['ident']=2,
		['castleMapType']=2,
		['name']="策略府"
	},
	[3]=
	{
		['allReward']=
		{

			{
				['Reward']="6;50;0",
				['level']=1
			},

			{
				['Reward']="6;50;0",
				['level']=2
			},

			{
				['Reward']="6;50;0",
				['level']=3
			},

			{
				['Reward']="6;50;0",
				['level']=4
			},

			{
				['Reward']="6;50;0",
				['level']=5
			},

			{
				['Reward']="6;50;0",
				['level']=6
			},

			{
				['Reward']="6;50;0",
				['level']=7
			},

			{
				['Reward']="6;50;0",
				['level']=8
			},

			{
				['Reward']="6;50;0",
				['level']=9
			},

			{
				['Reward']="6;50;0",
				['level']=10
			},

			{
				['Reward']="6;50;0",
				['level']=11
			},

			{
				['Reward']="6;50;0",
				['level']=12
			},

			{
				['Reward']="6;50;0",
				['level']=13
			},

			{
				['Reward']="6;50;0",
				['level']=14
			},

			{
				['Reward']="6;50;0",
				['level']=15
			},

			{
				['Reward']="6;50;0",
				['level']=16
			},

			{
				['Reward']="6;50;0",
				['level']=17
			},

			{
				['Reward']="6;50;0",
				['level']=18
			},

			{
				['Reward']="6;50;0",
				['level']=19
			},

			{
				['Reward']="6;50;0",
				['level']=20
			},

			{
				['Reward']="6;50;0",
				['level']=21
			},

			{
				['Reward']="6;50;0",
				['level']=22
			},

			{
				['Reward']="6;50;0",
				['level']=23
			},

			{
				['Reward']="6;50;0",
				['level']=24
			},

			{
				['Reward']="6;50;0",
				['level']=25
			},

			{
				['Reward']="6;50;0",
				['level']=26
			},

			{
				['Reward']="6;50;0",
				['level']=27
			},

			{
				['Reward']="6;50;0",
				['level']=28
			},

			{
				['Reward']="6;50;0",
				['level']=29
			},

			{
				['Reward']="6;50;0",
				['level']=30
			},

			{
				['Reward']="6;50;0",
				['level']=31
			},

			{
				['Reward']="6;50;0",
				['level']=32
			},

			{
				['Reward']="6;50;0",
				['level']=33
			},

			{
				['Reward']="6;50;0",
				['level']=34
			},

			{
				['Reward']="6;50;0",
				['level']=35
			},

			{
				['Reward']="6;50;0",
				['level']=36
			},

			{
				['Reward']="6;50;0",
				['level']=37
			},

			{
				['Reward']="6;50;0",
				['level']=38
			},

			{
				['Reward']="6;50;0",
				['level']=39
			},

			{
				['Reward']="6;50;0",
				['level']=40
			},

			{
				['Reward']="6;50;0",
				['level']=41
			},

			{
				['Reward']="6;50;0",
				['level']=42
			},

			{
				['Reward']="6;50;0",
				['level']=43
			},

			{
				['Reward']="6;50;0",
				['level']=44
			},

			{
				['Reward']="6;50;0",
				['level']=45
			},

			{
				['Reward']="6;50;0",
				['level']=46
			},

			{
				['Reward']="6;50;0",
				['level']=47
			},

			{
				['Reward']="6;50;0",
				['level']=48
			},

			{
				['Reward']="6;50;0",
				['level']=49
			},

			{
				['Reward']="6;50;0",
				['level']=50
			},

			{
				['Reward']="6;50;0",
				['level']=51
			},

			{
				['Reward']="6;50;0",
				['level']=52
			},

			{
				['Reward']="6;50;0",
				['level']=53
			},

			{
				['Reward']="6;50;0",
				['level']=54
			},

			{
				['Reward']="6;50;0",
				['level']=55
			},

			{
				['Reward']="6;50;0",
				['level']=56
			},

			{
				['Reward']="6;50;0",
				['level']=57
			},

			{
				['Reward']="6;50;0",
				['level']=58
			},

			{
				['Reward']="6;50;0",
				['level']=59
			},

			{
				['Reward']="6;50;0",
				['level']=60
			},

			{
				['Reward']="6;50;0",
				['level']=61
			},

			{
				['Reward']="6;50;0",
				['level']=62
			},

			{
				['Reward']="6;50;0",
				['level']=63
			},

			{
				['Reward']="6;50;0",
				['level']=64
			},

			{
				['Reward']="6;50;0",
				['level']=65
			},

			{
				['Reward']="6;50;0",
				['level']=66
			},

			{
				['Reward']="6;50;0",
				['level']=67
			},

			{
				['Reward']="6;50;0",
				['level']=68
			},

			{
				['Reward']="6;50;0",
				['level']=69
			},

			{
				['Reward']="6;50;0",
				['level']=70
			},

			{
				['Reward']="6;50;0",
				['level']=71
			},

			{
				['Reward']="6;50;0",
				['level']=72
			},

			{
				['Reward']="6;50;0",
				['level']=73
			},

			{
				['Reward']="6;50;0",
				['level']=74
			},

			{
				['Reward']="6;50;0",
				['level']=75
			},

			{
				['Reward']="6;50;0",
				['level']=76
			},

			{
				['Reward']="6;50;0",
				['level']=77
			},

			{
				['Reward']="6;50;0",
				['level']=78
			},

			{
				['Reward']="6;50;0",
				['level']=79
			},

			{
				['Reward']="6;50;0",
				['level']=80
			},

			{
				['Reward']="6;50;0",
				['level']=81
			},

			{
				['Reward']="6;50;0",
				['level']=82
			},

			{
				['Reward']="6;50;0",
				['level']=83
			},

			{
				['Reward']="6;50;0",
				['level']=84
			},

			{
				['Reward']="6;50;0",
				['level']=85
			},

			{
				['Reward']="6;50;0",
				['level']=86
			},

			{
				['Reward']="6;50;0",
				['level']=87
			},

			{
				['Reward']="6;50;0",
				['level']=88
			},

			{
				['Reward']="6;50;0",
				['level']=89
			},

			{
				['Reward']="6;50;0",
				['level']=90
			},

			{
				['Reward']="6;50;0",
				['level']=91
			},

			{
				['Reward']="6;50;0",
				['level']=92
			},

			{
				['Reward']="6;50;0",
				['level']=93
			},

			{
				['Reward']="6;50;0",
				['level']=94
			},

			{
				['Reward']="6;50;0",
				['level']=95
			},

			{
				['Reward']="6;50;0",
				['level']=96
			},

			{
				['Reward']="6;50;0",
				['level']=97
			},

			{
				['Reward']="6;50;0",
				['level']=98
			},

			{
				['Reward']="6;50;0",
				['level']=99
			},

			{
				['Reward']="6;50;0",
				['level']=100
			},

			{
				['Reward']="6;50;0",
				['level']=101
			},

			{
				['Reward']="6;50;0",
				['level']=102
			},

			{
				['Reward']="6;50;0",
				['level']=103
			},

			{
				['Reward']="6;50;0",
				['level']=104
			},

			{
				['Reward']="6;50;0",
				['level']=105
			},

			{
				['Reward']="6;50;0",
				['level']=106
			},

			{
				['Reward']="6;50;0",
				['level']=107
			},

			{
				['Reward']="6;50;0",
				['level']=108
			},

			{
				['Reward']="6;50;0",
				['level']=109
			},

			{
				['Reward']="6;50;0",
				['level']=110
			},

			{
				['Reward']="6;50;0",
				['level']=111
			},

			{
				['Reward']="6;50;0",
				['level']=112
			},

			{
				['Reward']="6;50;0",
				['level']=113
			},

			{
				['Reward']="6;50;0",
				['level']=114
			},

			{
				['Reward']="6;50;0",
				['level']=115
			},

			{
				['Reward']="6;50;0",
				['level']=116
			},

			{
				['Reward']="6;50;0",
				['level']=117
			},

			{
				['Reward']="6;50;0",
				['level']=118
			},

			{
				['Reward']="6;50;0",
				['level']=119
			},

			{
				['Reward']="6;50;0",
				['level']=120
			},

			{
				['Reward']="6;50;0",
				['level']=121
			},

			{
				['Reward']="6;50;0",
				['level']=122
			},

			{
				['Reward']="6;50;0",
				['level']=123
			},

			{
				['Reward']="6;50;0",
				['level']=124
			},

			{
				['Reward']="6;50;0",
				['level']=125
			},

			{
				['Reward']="6;50;0",
				['level']=126
			},

			{
				['Reward']="6;50;0",
				['level']=127
			},

			{
				['Reward']="6;50;0",
				['level']=128
			},

			{
				['Reward']="6;50;0",
				['level']=129
			},

			{
				['Reward']="6;50;0",
				['level']=130
			},

			{
				['Reward']="6;50;0",
				['level']=131
			},

			{
				['Reward']="6;50;0",
				['level']=132
			},

			{
				['Reward']="6;50;0",
				['level']=133
			},

			{
				['Reward']="6;50;0",
				['level']=134
			},

			{
				['Reward']="6;50;0",
				['level']=135
			},

			{
				['Reward']="6;50;0",
				['level']=136
			},

			{
				['Reward']="6;50;0",
				['level']=137
			},

			{
				['Reward']="6;50;0",
				['level']=138
			},

			{
				['Reward']="6;50;0",
				['level']=139
			},

			{
				['Reward']="6;50;0",
				['level']=140
			},

			{
				['Reward']="6;50;0",
				['level']=141
			},

			{
				['Reward']="6;50;0",
				['level']=142
			},

			{
				['Reward']="6;50;0",
				['level']=143
			},

			{
				['Reward']="6;50;0",
				['level']=144
			},

			{
				['Reward']="6;50;0",
				['level']=145
			},

			{
				['Reward']="6;50;0",
				['level']=146
			},

			{
				['Reward']="6;50;0",
				['level']=147
			},

			{
				['Reward']="6;50;0",
				['level']=148
			},

			{
				['Reward']="6;50;0",
				['level']=149
			},

			{
				['Reward']="6;50;0",
				['level']=150
			},

			{
				['Reward']="6;50;0",
				['level']=151
			},

			{
				['Reward']="6;50;0",
				['level']=152
			},

			{
				['Reward']="6;50;0",
				['level']=153
			},

			{
				['Reward']="6;50;0",
				['level']=154
			},

			{
				['Reward']="6;50;0",
				['level']=155
			},

			{
				['Reward']="6;50;0",
				['level']=156
			},

			{
				['Reward']="6;50;0",
				['level']=157
			},

			{
				['Reward']="6;50;0",
				['level']=158
			},

			{
				['Reward']="6;50;0",
				['level']=159
			},

			{
				['Reward']="6;50;0",
				['level']=160
			},

			{
				['Reward']="6;50;0",
				['level']=161
			},

			{
				['Reward']="6;50;0",
				['level']=162
			},

			{
				['Reward']="6;50;0",
				['level']=163
			},

			{
				['Reward']="6;50;0",
				['level']=164
			},

			{
				['Reward']="6;50;0",
				['level']=165
			},

			{
				['Reward']="6;50;0",
				['level']=166
			},

			{
				['Reward']="6;50;0",
				['level']=167
			},

			{
				['Reward']="6;50;0",
				['level']=168
			},

			{
				['Reward']="6;50;0",
				['level']=169
			},

			{
				['Reward']="6;50;0",
				['level']=170
			},

			{
				['Reward']="6;50;0",
				['level']=171
			},

			{
				['Reward']="6;50;0",
				['level']=172
			},

			{
				['Reward']="6;50;0",
				['level']=173
			},

			{
				['Reward']="6;50;0",
				['level']=174
			},

			{
				['Reward']="6;50;0",
				['level']=175
			},

			{
				['Reward']="6;50;0",
				['level']=176
			},

			{
				['Reward']="6;50;0",
				['level']=177
			},

			{
				['Reward']="6;50;0",
				['level']=178
			},

			{
				['Reward']="6;50;0",
				['level']=179
			},

			{
				['Reward']="6;50;0",
				['level']=180
			},

			{
				['Reward']="6;50;0",
				['level']=181
			},

			{
				['Reward']="6;50;0",
				['level']=182
			},

			{
				['Reward']="6;50;0",
				['level']=183
			},

			{
				['Reward']="6;50;0",
				['level']=184
			},

			{
				['Reward']="6;50;0",
				['level']=185
			},

			{
				['Reward']="6;50;0",
				['level']=186
			},

			{
				['Reward']="6;50;0",
				['level']=187
			},

			{
				['Reward']="6;50;0",
				['level']=188
			},

			{
				['Reward']="6;50;0",
				['level']=189
			},

			{
				['Reward']="6;50;0",
				['level']=190
			},

			{
				['Reward']="6;50;0",
				['level']=191
			},

			{
				['Reward']="6;50;0",
				['level']=192
			},

			{
				['Reward']="6;50;0",
				['level']=193
			},

			{
				['Reward']="6;50;0",
				['level']=194
			},

			{
				['Reward']="6;50;0",
				['level']=195
			},

			{
				['Reward']="6;50;0",
				['level']=196
			},

			{
				['Reward']="6;50;0",
				['level']=197
			},

			{
				['Reward']="6;50;0",
				['level']=198
			},

			{
				['Reward']="6;50;0",
				['level']=199
			},

			{
				['Reward']="6;50;0",
				['level']=200
			},

			{
				['Reward']="6;50;0",
				['level']=201
			},

			{
				['Reward']="6;50;0",
				['level']=202
			},

			{
				['Reward']="6;50;0",
				['level']=203
			},

			{
				['Reward']="6;50;0",
				['level']=204
			},

			{
				['Reward']="6;50;0",
				['level']=205
			},

			{
				['Reward']="6;50;0",
				['level']=206
			},

			{
				['Reward']="6;50;0",
				['level']=207
			},

			{
				['Reward']="6;50;0",
				['level']=208
			},

			{
				['Reward']="6;50;0",
				['level']=209
			},

			{
				['Reward']="6;50;0",
				['level']=210
			},

			{
				['Reward']="6;50;0",
				['level']=211
			},

			{
				['Reward']="6;50;0",
				['level']=212
			},

			{
				['Reward']="6;50;0",
				['level']=213
			},

			{
				['Reward']="6;50;0",
				['level']=214
			},

			{
				['Reward']="6;50;0",
				['level']=215
			},

			{
				['Reward']="6;50;0",
				['level']=216
			},

			{
				['Reward']="6;50;0",
				['level']=217
			},

			{
				['Reward']="6;50;0",
				['level']=218
			},

			{
				['Reward']="6;50;0",
				['level']=219
			},

			{
				['Reward']="6;50;0",
				['level']=220
			},

			{
				['Reward']="6;50;0",
				['level']=221
			},

			{
				['Reward']="6;50;0",
				['level']=222
			},

			{
				['Reward']="6;50;0",
				['level']=223
			},

			{
				['Reward']="6;50;0",
				['level']=224
			},

			{
				['Reward']="6;50;0",
				['level']=225
			},

			{
				['Reward']="6;50;0",
				['level']=226
			},

			{
				['Reward']="6;50;0",
				['level']=227
			},

			{
				['Reward']="6;50;0",
				['level']=228
			},

			{
				['Reward']="6;50;0",
				['level']=229
			},

			{
				['Reward']="6;50;0",
				['level']=230
			},

			{
				['Reward']="6;50;0",
				['level']=231
			},

			{
				['Reward']="6;50;0",
				['level']=232
			},

			{
				['Reward']="6;50;0",
				['level']=233
			},

			{
				['Reward']="6;50;0",
				['level']=234
			},

			{
				['Reward']="6;50;0",
				['level']=235
			},

			{
				['Reward']="6;50;0",
				['level']=236
			},

			{
				['Reward']="6;50;0",
				['level']=237
			},

			{
				['Reward']="6;50;0",
				['level']=238
			},

			{
				['Reward']="6;50;0",
				['level']=239
			},

			{
				['Reward']="6;50;0",
				['level']=240
			},

			{
				['Reward']="6;50;0",
				['level']=241
			},

			{
				['Reward']="6;50;0",
				['level']=242
			},

			{
				['Reward']="6;50;0",
				['level']=243
			},

			{
				['Reward']="6;50;0",
				['level']=244
			},

			{
				['Reward']="6;50;0",
				['level']=245
			},

			{
				['Reward']="6;50;0",
				['level']=246
			},

			{
				['Reward']="6;50;0",
				['level']=247
			},

			{
				['Reward']="6;50;0",
				['level']=248
			},

			{
				['Reward']="6;50;0",
				['level']=249
			},

			{
				['Reward']="6;50;0",
				['level']=250
			},

			{
				['Reward']="6;50;0",
				['level']=251
			},

			{
				['Reward']="6;50;0",
				['level']=252
			},

			{
				['Reward']="6;50;0",
				['level']=253
			},

			{
				['Reward']="6;50;0",
				['level']=254
			},

			{
				['Reward']="6;50;0",
				['level']=255
			},

			{
				['Reward']="6;50;0",
				['level']=256
			},

			{
				['Reward']="6;50;0",
				['level']=257
			},

			{
				['Reward']="6;50;0",
				['level']=258
			},

			{
				['Reward']="6;50;0",
				['level']=259
			},

			{
				['Reward']="6;50;0",
				['level']=260
			},

			{
				['Reward']="6;50;0",
				['level']=261
			},

			{
				['Reward']="6;50;0",
				['level']=262
			},

			{
				['Reward']="6;50;0",
				['level']=263
			},

			{
				['Reward']="6;50;0",
				['level']=264
			},

			{
				['Reward']="6;50;0",
				['level']=265
			},

			{
				['Reward']="6;50;0",
				['level']=266
			},

			{
				['Reward']="6;50;0",
				['level']=267
			},

			{
				['Reward']="6;50;0",
				['level']=268
			},

			{
				['Reward']="6;50;0",
				['level']=269
			},

			{
				['Reward']="6;50;0",
				['level']=270
			}
		},
		['ident']=3,
		['castleMapType']=3,
		['name']="铁矿"
	},
	[4]=
	{
		['allReward']=
		{

			{
				['Reward']="101;10000;0",
				['level']=1
			},

			{
				['Reward']="101;10000;0",
				['level']=2
			},

			{
				['Reward']="101;10000;0",
				['level']=3
			},

			{
				['Reward']="101;10000;0",
				['level']=4
			},

			{
				['Reward']="101;10000;0",
				['level']=5
			},

			{
				['Reward']="101;10000;0",
				['level']=6
			},

			{
				['Reward']="101;10000;0",
				['level']=7
			},

			{
				['Reward']="101;10000;0",
				['level']=8
			},

			{
				['Reward']="101;10000;0",
				['level']=9
			},

			{
				['Reward']="101;10000;0",
				['level']=10
			},

			{
				['Reward']="101;10000;0",
				['level']=11
			},

			{
				['Reward']="101;10000;0",
				['level']=12
			},

			{
				['Reward']="101;10000;0",
				['level']=13
			},

			{
				['Reward']="101;10000;0",
				['level']=14
			},

			{
				['Reward']="101;10000;0",
				['level']=15
			},

			{
				['Reward']="101;10000;0",
				['level']=16
			},

			{
				['Reward']="101;10000;0",
				['level']=17
			},

			{
				['Reward']="101;10000;0",
				['level']=18
			},

			{
				['Reward']="101;10000;0",
				['level']=19
			},

			{
				['Reward']="101;10000;0",
				['level']=20
			},

			{
				['Reward']="101;10000;0",
				['level']=21
			},

			{
				['Reward']="101;10000;0",
				['level']=22
			},

			{
				['Reward']="101;10000;0",
				['level']=23
			},

			{
				['Reward']="101;10000;0",
				['level']=24
			},

			{
				['Reward']="101;10000;0",
				['level']=25
			},

			{
				['Reward']="101;10000;0",
				['level']=26
			},

			{
				['Reward']="101;10000;0",
				['level']=27
			},

			{
				['Reward']="101;10000;0",
				['level']=28
			},

			{
				['Reward']="101;10000;0",
				['level']=29
			},

			{
				['Reward']="101;10000;0",
				['level']=30
			},

			{
				['Reward']="101;10000;0",
				['level']=31
			},

			{
				['Reward']="101;10000;0",
				['level']=32
			},

			{
				['Reward']="101;10000;0",
				['level']=33
			},

			{
				['Reward']="101;10000;0",
				['level']=34
			},

			{
				['Reward']="101;10000;0",
				['level']=35
			},

			{
				['Reward']="101;10000;0",
				['level']=36
			},

			{
				['Reward']="101;10000;0",
				['level']=37
			},

			{
				['Reward']="101;10000;0",
				['level']=38
			},

			{
				['Reward']="101;10000;0",
				['level']=39
			},

			{
				['Reward']="101;10000;0",
				['level']=40
			},

			{
				['Reward']="101;10000;0",
				['level']=41
			},

			{
				['Reward']="101;10000;0",
				['level']=42
			},

			{
				['Reward']="101;10000;0",
				['level']=43
			},

			{
				['Reward']="101;10000;0",
				['level']=44
			},

			{
				['Reward']="101;10000;0",
				['level']=45
			},

			{
				['Reward']="101;10000;0",
				['level']=46
			},

			{
				['Reward']="101;10000;0",
				['level']=47
			},

			{
				['Reward']="101;10000;0",
				['level']=48
			},

			{
				['Reward']="101;10000;0",
				['level']=49
			},

			{
				['Reward']="101;10000;0",
				['level']=50
			},

			{
				['Reward']="101;10000;0",
				['level']=51
			},

			{
				['Reward']="101;10000;0",
				['level']=52
			},

			{
				['Reward']="101;10000;0",
				['level']=53
			},

			{
				['Reward']="101;10000;0",
				['level']=54
			},

			{
				['Reward']="101;10000;0",
				['level']=55
			},

			{
				['Reward']="101;10000;0",
				['level']=56
			},

			{
				['Reward']="101;10000;0",
				['level']=57
			},

			{
				['Reward']="101;10000;0",
				['level']=58
			},

			{
				['Reward']="101;10000;0",
				['level']=59
			},

			{
				['Reward']="101;10000;0",
				['level']=60
			},

			{
				['Reward']="101;10000;0",
				['level']=61
			},

			{
				['Reward']="101;10000;0",
				['level']=62
			},

			{
				['Reward']="101;10000;0",
				['level']=63
			},

			{
				['Reward']="101;10000;0",
				['level']=64
			},

			{
				['Reward']="101;10000;0",
				['level']=65
			},

			{
				['Reward']="101;10000;0",
				['level']=66
			},

			{
				['Reward']="101;10000;0",
				['level']=67
			},

			{
				['Reward']="101;10000;0",
				['level']=68
			},

			{
				['Reward']="101;10000;0",
				['level']=69
			},

			{
				['Reward']="101;10000;0",
				['level']=70
			},

			{
				['Reward']="101;10000;0",
				['level']=71
			},

			{
				['Reward']="101;10000;0",
				['level']=72
			},

			{
				['Reward']="101;10000;0",
				['level']=73
			},

			{
				['Reward']="101;10000;0",
				['level']=74
			},

			{
				['Reward']="101;10000;0",
				['level']=75
			},

			{
				['Reward']="101;10000;0",
				['level']=76
			},

			{
				['Reward']="101;10000;0",
				['level']=77
			},

			{
				['Reward']="101;10000;0",
				['level']=78
			},

			{
				['Reward']="101;10000;0",
				['level']=79
			},

			{
				['Reward']="101;10000;0",
				['level']=80
			},

			{
				['Reward']="101;10000;0",
				['level']=81
			},

			{
				['Reward']="101;10000;0",
				['level']=82
			},

			{
				['Reward']="101;10000;0",
				['level']=83
			},

			{
				['Reward']="101;10000;0",
				['level']=84
			},

			{
				['Reward']="101;10000;0",
				['level']=85
			},

			{
				['Reward']="101;10000;0",
				['level']=86
			},

			{
				['Reward']="101;10000;0",
				['level']=87
			},

			{
				['Reward']="101;10000;0",
				['level']=88
			},

			{
				['Reward']="101;10000;0",
				['level']=89
			},

			{
				['Reward']="101;10000;0",
				['level']=90
			},

			{
				['Reward']="101;10000;0",
				['level']=91
			},

			{
				['Reward']="101;10000;0",
				['level']=92
			},

			{
				['Reward']="101;10000;0",
				['level']=93
			},

			{
				['Reward']="101;10000;0",
				['level']=94
			},

			{
				['Reward']="101;10000;0",
				['level']=95
			},

			{
				['Reward']="101;10000;0",
				['level']=96
			},

			{
				['Reward']="101;10000;0",
				['level']=97
			},

			{
				['Reward']="101;10000;0",
				['level']=98
			},

			{
				['Reward']="101;10000;0",
				['level']=99
			},

			{
				['Reward']="101;10000;0",
				['level']=100
			},

			{
				['Reward']="101;10000;0",
				['level']=101
			},

			{
				['Reward']="101;10000;0",
				['level']=102
			},

			{
				['Reward']="101;10000;0",
				['level']=103
			},

			{
				['Reward']="101;10000;0",
				['level']=104
			},

			{
				['Reward']="101;10000;0",
				['level']=105
			},

			{
				['Reward']="101;10000;0",
				['level']=106
			},

			{
				['Reward']="101;10000;0",
				['level']=107
			},

			{
				['Reward']="101;10000;0",
				['level']=108
			},

			{
				['Reward']="101;10000;0",
				['level']=109
			},

			{
				['Reward']="101;10000;0",
				['level']=110
			},

			{
				['Reward']="101;10000;0",
				['level']=111
			},

			{
				['Reward']="101;10000;0",
				['level']=112
			},

			{
				['Reward']="101;10000;0",
				['level']=113
			},

			{
				['Reward']="101;10000;0",
				['level']=114
			},

			{
				['Reward']="101;10000;0",
				['level']=115
			},

			{
				['Reward']="101;10000;0",
				['level']=116
			},

			{
				['Reward']="101;10000;0",
				['level']=117
			},

			{
				['Reward']="101;10000;0",
				['level']=118
			},

			{
				['Reward']="101;10000;0",
				['level']=119
			},

			{
				['Reward']="101;10000;0",
				['level']=120
			},

			{
				['Reward']="101;10000;0",
				['level']=121
			},

			{
				['Reward']="101;10000;0",
				['level']=122
			},

			{
				['Reward']="101;10000;0",
				['level']=123
			},

			{
				['Reward']="101;10000;0",
				['level']=124
			},

			{
				['Reward']="101;10000;0",
				['level']=125
			},

			{
				['Reward']="101;10000;0",
				['level']=126
			},

			{
				['Reward']="101;10000;0",
				['level']=127
			},

			{
				['Reward']="101;10000;0",
				['level']=128
			},

			{
				['Reward']="101;10000;0",
				['level']=129
			},

			{
				['Reward']="101;10000;0",
				['level']=130
			},

			{
				['Reward']="101;10000;0",
				['level']=131
			},

			{
				['Reward']="101;10000;0",
				['level']=132
			},

			{
				['Reward']="101;10000;0",
				['level']=133
			},

			{
				['Reward']="101;10000;0",
				['level']=134
			},

			{
				['Reward']="101;10000;0",
				['level']=135
			},

			{
				['Reward']="101;10000;0",
				['level']=136
			},

			{
				['Reward']="101;10000;0",
				['level']=137
			},

			{
				['Reward']="101;10000;0",
				['level']=138
			},

			{
				['Reward']="101;10000;0",
				['level']=139
			},

			{
				['Reward']="101;10000;0",
				['level']=140
			},

			{
				['Reward']="101;10000;0",
				['level']=141
			},

			{
				['Reward']="101;10000;0",
				['level']=142
			},

			{
				['Reward']="101;10000;0",
				['level']=143
			},

			{
				['Reward']="101;10000;0",
				['level']=144
			},

			{
				['Reward']="101;10000;0",
				['level']=145
			},

			{
				['Reward']="101;10000;0",
				['level']=146
			},

			{
				['Reward']="101;10000;0",
				['level']=147
			},

			{
				['Reward']="101;10000;0",
				['level']=148
			},

			{
				['Reward']="101;10000;0",
				['level']=149
			},

			{
				['Reward']="101;10000;0",
				['level']=150
			},

			{
				['Reward']="101;10000;0",
				['level']=151
			},

			{
				['Reward']="101;10000;0",
				['level']=152
			},

			{
				['Reward']="101;10000;0",
				['level']=153
			},

			{
				['Reward']="101;10000;0",
				['level']=154
			},

			{
				['Reward']="101;10000;0",
				['level']=155
			},

			{
				['Reward']="101;10000;0",
				['level']=156
			},

			{
				['Reward']="101;10000;0",
				['level']=157
			},

			{
				['Reward']="101;10000;0",
				['level']=158
			},

			{
				['Reward']="101;10000;0",
				['level']=159
			},

			{
				['Reward']="101;10000;0",
				['level']=160
			},

			{
				['Reward']="101;10000;0",
				['level']=161
			},

			{
				['Reward']="101;10000;0",
				['level']=162
			},

			{
				['Reward']="101;10000;0",
				['level']=163
			},

			{
				['Reward']="101;10000;0",
				['level']=164
			},

			{
				['Reward']="101;10000;0",
				['level']=165
			},

			{
				['Reward']="101;10000;0",
				['level']=166
			},

			{
				['Reward']="101;10000;0",
				['level']=167
			},

			{
				['Reward']="101;10000;0",
				['level']=168
			},

			{
				['Reward']="101;10000;0",
				['level']=169
			},

			{
				['Reward']="101;10000;0",
				['level']=170
			},

			{
				['Reward']="101;10000;0",
				['level']=171
			},

			{
				['Reward']="101;10000;0",
				['level']=172
			},

			{
				['Reward']="101;10000;0",
				['level']=173
			},

			{
				['Reward']="101;10000;0",
				['level']=174
			},

			{
				['Reward']="101;10000;0",
				['level']=175
			},

			{
				['Reward']="101;10000;0",
				['level']=176
			},

			{
				['Reward']="101;10000;0",
				['level']=177
			},

			{
				['Reward']="101;10000;0",
				['level']=178
			},

			{
				['Reward']="101;10000;0",
				['level']=179
			},

			{
				['Reward']="101;10000;0",
				['level']=180
			},

			{
				['Reward']="101;10000;0",
				['level']=181
			},

			{
				['Reward']="101;10000;0",
				['level']=182
			},

			{
				['Reward']="101;10000;0",
				['level']=183
			},

			{
				['Reward']="101;10000;0",
				['level']=184
			},

			{
				['Reward']="101;10000;0",
				['level']=185
			},

			{
				['Reward']="101;10000;0",
				['level']=186
			},

			{
				['Reward']="101;10000;0",
				['level']=187
			},

			{
				['Reward']="101;10000;0",
				['level']=188
			},

			{
				['Reward']="101;10000;0",
				['level']=189
			},

			{
				['Reward']="101;10000;0",
				['level']=190
			},

			{
				['Reward']="101;10000;0",
				['level']=191
			},

			{
				['Reward']="101;10000;0",
				['level']=192
			},

			{
				['Reward']="101;10000;0",
				['level']=193
			},

			{
				['Reward']="101;10000;0",
				['level']=194
			},

			{
				['Reward']="101;10000;0",
				['level']=195
			},

			{
				['Reward']="101;10000;0",
				['level']=196
			},

			{
				['Reward']="101;10000;0",
				['level']=197
			},

			{
				['Reward']="101;10000;0",
				['level']=198
			},

			{
				['Reward']="101;10000;0",
				['level']=199
			},

			{
				['Reward']="101;10000;0",
				['level']=200
			},

			{
				['Reward']="101;10000;0",
				['level']=201
			},

			{
				['Reward']="101;10000;0",
				['level']=202
			},

			{
				['Reward']="101;10000;0",
				['level']=203
			},

			{
				['Reward']="101;10000;0",
				['level']=204
			},

			{
				['Reward']="101;10000;0",
				['level']=205
			},

			{
				['Reward']="101;10000;0",
				['level']=206
			},

			{
				['Reward']="101;10000;0",
				['level']=207
			},

			{
				['Reward']="101;10000;0",
				['level']=208
			},

			{
				['Reward']="101;10000;0",
				['level']=209
			},

			{
				['Reward']="101;10000;0",
				['level']=210
			},

			{
				['Reward']="101;10000;0",
				['level']=211
			},

			{
				['Reward']="101;10000;0",
				['level']=212
			},

			{
				['Reward']="101;10000;0",
				['level']=213
			},

			{
				['Reward']="101;10000;0",
				['level']=214
			},

			{
				['Reward']="101;10000;0",
				['level']=215
			},

			{
				['Reward']="101;10000;0",
				['level']=216
			},

			{
				['Reward']="101;10000;0",
				['level']=217
			},

			{
				['Reward']="101;10000;0",
				['level']=218
			},

			{
				['Reward']="101;10000;0",
				['level']=219
			},

			{
				['Reward']="101;10000;0",
				['level']=220
			},

			{
				['Reward']="101;10000;0",
				['level']=221
			},

			{
				['Reward']="101;10000;0",
				['level']=222
			},

			{
				['Reward']="101;10000;0",
				['level']=223
			},

			{
				['Reward']="101;10000;0",
				['level']=224
			},

			{
				['Reward']="101;10000;0",
				['level']=225
			},

			{
				['Reward']="101;10000;0",
				['level']=226
			},

			{
				['Reward']="101;10000;0",
				['level']=227
			},

			{
				['Reward']="101;10000;0",
				['level']=228
			},

			{
				['Reward']="101;10000;0",
				['level']=229
			},

			{
				['Reward']="101;10000;0",
				['level']=230
			},

			{
				['Reward']="101;10000;0",
				['level']=231
			},

			{
				['Reward']="101;10000;0",
				['level']=232
			},

			{
				['Reward']="101;10000;0",
				['level']=233
			},

			{
				['Reward']="101;10000;0",
				['level']=234
			},

			{
				['Reward']="101;10000;0",
				['level']=235
			},

			{
				['Reward']="101;10000;0",
				['level']=236
			},

			{
				['Reward']="101;10000;0",
				['level']=237
			},

			{
				['Reward']="101;10000;0",
				['level']=238
			},

			{
				['Reward']="101;10000;0",
				['level']=239
			},

			{
				['Reward']="101;10000;0",
				['level']=240
			},

			{
				['Reward']="101;10000;0",
				['level']=241
			},

			{
				['Reward']="101;10000;0",
				['level']=242
			},

			{
				['Reward']="101;10000;0",
				['level']=243
			},

			{
				['Reward']="101;10000;0",
				['level']=244
			},

			{
				['Reward']="101;10000;0",
				['level']=245
			},

			{
				['Reward']="101;10000;0",
				['level']=246
			},

			{
				['Reward']="101;10000;0",
				['level']=247
			},

			{
				['Reward']="101;10000;0",
				['level']=248
			},

			{
				['Reward']="101;10000;0",
				['level']=249
			},

			{
				['Reward']="101;10000;0",
				['level']=250
			},

			{
				['Reward']="101;10000;0",
				['level']=251
			},

			{
				['Reward']="101;10000;0",
				['level']=252
			},

			{
				['Reward']="101;10000;0",
				['level']=253
			},

			{
				['Reward']="101;10000;0",
				['level']=254
			},

			{
				['Reward']="101;10000;0",
				['level']=255
			},

			{
				['Reward']="101;10000;0",
				['level']=256
			},

			{
				['Reward']="101;10000;0",
				['level']=257
			},

			{
				['Reward']="101;10000;0",
				['level']=258
			},

			{
				['Reward']="101;10000;0",
				['level']=259
			},

			{
				['Reward']="101;10000;0",
				['level']=260
			},

			{
				['Reward']="101;10000;0",
				['level']=261
			},

			{
				['Reward']="101;10000;0",
				['level']=262
			},

			{
				['Reward']="101;10000;0",
				['level']=263
			},

			{
				['Reward']="101;10000;0",
				['level']=264
			},

			{
				['Reward']="101;10000;0",
				['level']=265
			},

			{
				['Reward']="101;10000;0",
				['level']=266
			},

			{
				['Reward']="101;10000;0",
				['level']=267
			},

			{
				['Reward']="101;10000;0",
				['level']=268
			},

			{
				['Reward']="101;10000;0",
				['level']=269
			},

			{
				['Reward']="101;10000;0",
				['level']=270
			}
		},
		['ident']=4,
		['castleMapType']=4,
		['name']="民居"
	},
	[5]=
	{
		['allReward']=
		{

			{
				['Reward']="5;1000;0",
				['level']=1
			},

			{
				['Reward']="5;1000;0",
				['level']=2
			},

			{
				['Reward']="5;1000;0",
				['level']=3
			},

			{
				['Reward']="5;1000;0",
				['level']=4
			},

			{
				['Reward']="5;1000;0",
				['level']=5
			},

			{
				['Reward']="5;1000;0",
				['level']=6
			},

			{
				['Reward']="5;1000;0",
				['level']=7
			},

			{
				['Reward']="5;1000;0",
				['level']=8
			},

			{
				['Reward']="5;1000;0",
				['level']=9
			},

			{
				['Reward']="5;1000;0",
				['level']=10
			},

			{
				['Reward']="5;1000;0",
				['level']=11
			},

			{
				['Reward']="5;1000;0",
				['level']=12
			},

			{
				['Reward']="5;1000;0",
				['level']=13
			},

			{
				['Reward']="5;1000;0",
				['level']=14
			},

			{
				['Reward']="5;1000;0",
				['level']=15
			},

			{
				['Reward']="5;1000;0",
				['level']=16
			},

			{
				['Reward']="5;1000;0",
				['level']=17
			},

			{
				['Reward']="5;1000;0",
				['level']=18
			},

			{
				['Reward']="5;1000;0",
				['level']=19
			},

			{
				['Reward']="5;1000;0",
				['level']=20
			},

			{
				['Reward']="5;1000;0",
				['level']=21
			},

			{
				['Reward']="5;1000;0",
				['level']=22
			},

			{
				['Reward']="5;1000;0",
				['level']=23
			},

			{
				['Reward']="5;1000;0",
				['level']=24
			},

			{
				['Reward']="5;1000;0",
				['level']=25
			},

			{
				['Reward']="5;1000;0",
				['level']=26
			},

			{
				['Reward']="5;1000;0",
				['level']=27
			},

			{
				['Reward']="5;1000;0",
				['level']=28
			},

			{
				['Reward']="5;1000;0",
				['level']=29
			},

			{
				['Reward']="5;1000;0",
				['level']=30
			},

			{
				['Reward']="5;1000;0",
				['level']=31
			},

			{
				['Reward']="5;1000;0",
				['level']=32
			},

			{
				['Reward']="5;1000;0",
				['level']=33
			},

			{
				['Reward']="5;1000;0",
				['level']=34
			},

			{
				['Reward']="5;1000;0",
				['level']=35
			},

			{
				['Reward']="5;1000;0",
				['level']=36
			},

			{
				['Reward']="5;1000;0",
				['level']=37
			},

			{
				['Reward']="5;1000;0",
				['level']=38
			},

			{
				['Reward']="5;1000;0",
				['level']=39
			},

			{
				['Reward']="5;1000;0",
				['level']=40
			},

			{
				['Reward']="5;1000;0",
				['level']=41
			},

			{
				['Reward']="5;1000;0",
				['level']=42
			},

			{
				['Reward']="5;1000;0",
				['level']=43
			},

			{
				['Reward']="5;1000;0",
				['level']=44
			},

			{
				['Reward']="5;1000;0",
				['level']=45
			},

			{
				['Reward']="5;1000;0",
				['level']=46
			},

			{
				['Reward']="5;1000;0",
				['level']=47
			},

			{
				['Reward']="5;1000;0",
				['level']=48
			},

			{
				['Reward']="5;1000;0",
				['level']=49
			},

			{
				['Reward']="5;1000;0",
				['level']=50
			},

			{
				['Reward']="5;1000;0",
				['level']=51
			},

			{
				['Reward']="5;1000;0",
				['level']=52
			},

			{
				['Reward']="5;1000;0",
				['level']=53
			},

			{
				['Reward']="5;1000;0",
				['level']=54
			},

			{
				['Reward']="5;1000;0",
				['level']=55
			},

			{
				['Reward']="5;1000;0",
				['level']=56
			},

			{
				['Reward']="5;1000;0",
				['level']=57
			},

			{
				['Reward']="5;1000;0",
				['level']=58
			},

			{
				['Reward']="5;1000;0",
				['level']=59
			},

			{
				['Reward']="5;1000;0",
				['level']=60
			},

			{
				['Reward']="5;1000;0",
				['level']=61
			},

			{
				['Reward']="5;1000;0",
				['level']=62
			},

			{
				['Reward']="5;1000;0",
				['level']=63
			},

			{
				['Reward']="5;1000;0",
				['level']=64
			},

			{
				['Reward']="5;1000;0",
				['level']=65
			},

			{
				['Reward']="5;1000;0",
				['level']=66
			},

			{
				['Reward']="5;1000;0",
				['level']=67
			},

			{
				['Reward']="5;1000;0",
				['level']=68
			},

			{
				['Reward']="5;1000;0",
				['level']=69
			},

			{
				['Reward']="5;1000;0",
				['level']=70
			},

			{
				['Reward']="5;1000;0",
				['level']=71
			},

			{
				['Reward']="5;1000;0",
				['level']=72
			},

			{
				['Reward']="5;1000;0",
				['level']=73
			},

			{
				['Reward']="5;1000;0",
				['level']=74
			},

			{
				['Reward']="5;1000;0",
				['level']=75
			},

			{
				['Reward']="5;1000;0",
				['level']=76
			},

			{
				['Reward']="5;1000;0",
				['level']=77
			},

			{
				['Reward']="5;1000;0",
				['level']=78
			},

			{
				['Reward']="5;1000;0",
				['level']=79
			},

			{
				['Reward']="5;1000;0",
				['level']=80
			},

			{
				['Reward']="5;1000;0",
				['level']=81
			},

			{
				['Reward']="5;1000;0",
				['level']=82
			},

			{
				['Reward']="5;1000;0",
				['level']=83
			},

			{
				['Reward']="5;1000;0",
				['level']=84
			},

			{
				['Reward']="5;1000;0",
				['level']=85
			},

			{
				['Reward']="5;1000;0",
				['level']=86
			},

			{
				['Reward']="5;1000;0",
				['level']=87
			},

			{
				['Reward']="5;1000;0",
				['level']=88
			},

			{
				['Reward']="5;1000;0",
				['level']=89
			},

			{
				['Reward']="5;1000;0",
				['level']=90
			},

			{
				['Reward']="5;1000;0",
				['level']=91
			},

			{
				['Reward']="5;1000;0",
				['level']=92
			},

			{
				['Reward']="5;1000;0",
				['level']=93
			},

			{
				['Reward']="5;1000;0",
				['level']=94
			},

			{
				['Reward']="5;1000;0",
				['level']=95
			},

			{
				['Reward']="5;1000;0",
				['level']=96
			},

			{
				['Reward']="5;1000;0",
				['level']=97
			},

			{
				['Reward']="5;1000;0",
				['level']=98
			},

			{
				['Reward']="5;1000;0",
				['level']=99
			},

			{
				['Reward']="5;1000;0",
				['level']=100
			},

			{
				['Reward']="5;1000;0",
				['level']=101
			},

			{
				['Reward']="5;1000;0",
				['level']=102
			},

			{
				['Reward']="5;1000;0",
				['level']=103
			},

			{
				['Reward']="5;1000;0",
				['level']=104
			},

			{
				['Reward']="5;1000;0",
				['level']=105
			},

			{
				['Reward']="5;1000;0",
				['level']=106
			},

			{
				['Reward']="5;1000;0",
				['level']=107
			},

			{
				['Reward']="5;1000;0",
				['level']=108
			},

			{
				['Reward']="5;1000;0",
				['level']=109
			},

			{
				['Reward']="5;1000;0",
				['level']=110
			},

			{
				['Reward']="5;1000;0",
				['level']=111
			},

			{
				['Reward']="5;1000;0",
				['level']=112
			},

			{
				['Reward']="5;1000;0",
				['level']=113
			},

			{
				['Reward']="5;1000;0",
				['level']=114
			},

			{
				['Reward']="5;1000;0",
				['level']=115
			},

			{
				['Reward']="5;1000;0",
				['level']=116
			},

			{
				['Reward']="5;1000;0",
				['level']=117
			},

			{
				['Reward']="5;1000;0",
				['level']=118
			},

			{
				['Reward']="5;1000;0",
				['level']=119
			},

			{
				['Reward']="5;1000;0",
				['level']=120
			},

			{
				['Reward']="5;1000;0",
				['level']=121
			},

			{
				['Reward']="5;1000;0",
				['level']=122
			},

			{
				['Reward']="5;1000;0",
				['level']=123
			},

			{
				['Reward']="5;1000;0",
				['level']=124
			},

			{
				['Reward']="5;1000;0",
				['level']=125
			},

			{
				['Reward']="5;1000;0",
				['level']=126
			},

			{
				['Reward']="5;1000;0",
				['level']=127
			},

			{
				['Reward']="5;1000;0",
				['level']=128
			},

			{
				['Reward']="5;1000;0",
				['level']=129
			},

			{
				['Reward']="5;1000;0",
				['level']=130
			},

			{
				['Reward']="5;1000;0",
				['level']=131
			},

			{
				['Reward']="5;1000;0",
				['level']=132
			},

			{
				['Reward']="5;1000;0",
				['level']=133
			},

			{
				['Reward']="5;1000;0",
				['level']=134
			},

			{
				['Reward']="5;1000;0",
				['level']=135
			},

			{
				['Reward']="5;1000;0",
				['level']=136
			},

			{
				['Reward']="5;1000;0",
				['level']=137
			},

			{
				['Reward']="5;1000;0",
				['level']=138
			},

			{
				['Reward']="5;1000;0",
				['level']=139
			},

			{
				['Reward']="5;1000;0",
				['level']=140
			},

			{
				['Reward']="5;1000;0",
				['level']=141
			},

			{
				['Reward']="5;1000;0",
				['level']=142
			},

			{
				['Reward']="5;1000;0",
				['level']=143
			},

			{
				['Reward']="5;1000;0",
				['level']=144
			},

			{
				['Reward']="5;1000;0",
				['level']=145
			},

			{
				['Reward']="5;1000;0",
				['level']=146
			},

			{
				['Reward']="5;1000;0",
				['level']=147
			},

			{
				['Reward']="5;1000;0",
				['level']=148
			},

			{
				['Reward']="5;1000;0",
				['level']=149
			},

			{
				['Reward']="5;1000;0",
				['level']=150
			},

			{
				['Reward']="5;1000;0",
				['level']=151
			},

			{
				['Reward']="5;1000;0",
				['level']=152
			},

			{
				['Reward']="5;1000;0",
				['level']=153
			},

			{
				['Reward']="5;1000;0",
				['level']=154
			},

			{
				['Reward']="5;1000;0",
				['level']=155
			},

			{
				['Reward']="5;1000;0",
				['level']=156
			},

			{
				['Reward']="5;1000;0",
				['level']=157
			},

			{
				['Reward']="5;1000;0",
				['level']=158
			},

			{
				['Reward']="5;1000;0",
				['level']=159
			},

			{
				['Reward']="5;1000;0",
				['level']=160
			},

			{
				['Reward']="5;1000;0",
				['level']=161
			},

			{
				['Reward']="5;1000;0",
				['level']=162
			},

			{
				['Reward']="5;1000;0",
				['level']=163
			},

			{
				['Reward']="5;1000;0",
				['level']=164
			},

			{
				['Reward']="5;1000;0",
				['level']=165
			},

			{
				['Reward']="5;1000;0",
				['level']=166
			},

			{
				['Reward']="5;1000;0",
				['level']=167
			},

			{
				['Reward']="5;1000;0",
				['level']=168
			},

			{
				['Reward']="5;1000;0",
				['level']=169
			},

			{
				['Reward']="5;1000;0",
				['level']=170
			},

			{
				['Reward']="5;1000;0",
				['level']=171
			},

			{
				['Reward']="5;1000;0",
				['level']=172
			},

			{
				['Reward']="5;1000;0",
				['level']=173
			},

			{
				['Reward']="5;1000;0",
				['level']=174
			},

			{
				['Reward']="5;1000;0",
				['level']=175
			},

			{
				['Reward']="5;1000;0",
				['level']=176
			},

			{
				['Reward']="5;1000;0",
				['level']=177
			},

			{
				['Reward']="5;1000;0",
				['level']=178
			},

			{
				['Reward']="5;1000;0",
				['level']=179
			},

			{
				['Reward']="5;1000;0",
				['level']=180
			},

			{
				['Reward']="5;1000;0",
				['level']=181
			},

			{
				['Reward']="5;1000;0",
				['level']=182
			},

			{
				['Reward']="5;1000;0",
				['level']=183
			},

			{
				['Reward']="5;1000;0",
				['level']=184
			},

			{
				['Reward']="5;1000;0",
				['level']=185
			},

			{
				['Reward']="5;1000;0",
				['level']=186
			},

			{
				['Reward']="5;1000;0",
				['level']=187
			},

			{
				['Reward']="5;1000;0",
				['level']=188
			},

			{
				['Reward']="5;1000;0",
				['level']=189
			},

			{
				['Reward']="5;1000;0",
				['level']=190
			},

			{
				['Reward']="5;1000;0",
				['level']=191
			},

			{
				['Reward']="5;1000;0",
				['level']=192
			},

			{
				['Reward']="5;1000;0",
				['level']=193
			},

			{
				['Reward']="5;1000;0",
				['level']=194
			},

			{
				['Reward']="5;1000;0",
				['level']=195
			},

			{
				['Reward']="5;1000;0",
				['level']=196
			},

			{
				['Reward']="5;1000;0",
				['level']=197
			},

			{
				['Reward']="5;1000;0",
				['level']=198
			},

			{
				['Reward']="5;1000;0",
				['level']=199
			},

			{
				['Reward']="5;1000;0",
				['level']=200
			},

			{
				['Reward']="5;1000;0",
				['level']=201
			},

			{
				['Reward']="5;1000;0",
				['level']=202
			},

			{
				['Reward']="5;1000;0",
				['level']=203
			},

			{
				['Reward']="5;1000;0",
				['level']=204
			},

			{
				['Reward']="5;1000;0",
				['level']=205
			},

			{
				['Reward']="5;1000;0",
				['level']=206
			},

			{
				['Reward']="5;1000;0",
				['level']=207
			},

			{
				['Reward']="5;1000;0",
				['level']=208
			},

			{
				['Reward']="5;1000;0",
				['level']=209
			},

			{
				['Reward']="5;1000;0",
				['level']=210
			},

			{
				['Reward']="5;1000;0",
				['level']=211
			},

			{
				['Reward']="5;1000;0",
				['level']=212
			},

			{
				['Reward']="5;1000;0",
				['level']=213
			},

			{
				['Reward']="5;1000;0",
				['level']=214
			},

			{
				['Reward']="5;1000;0",
				['level']=215
			},

			{
				['Reward']="5;1000;0",
				['level']=216
			},

			{
				['Reward']="5;1000;0",
				['level']=217
			},

			{
				['Reward']="5;1000;0",
				['level']=218
			},

			{
				['Reward']="5;1000;0",
				['level']=219
			},

			{
				['Reward']="5;1000;0",
				['level']=220
			},

			{
				['Reward']="5;1000;0",
				['level']=221
			},

			{
				['Reward']="5;1000;0",
				['level']=222
			},

			{
				['Reward']="5;1000;0",
				['level']=223
			},

			{
				['Reward']="5;1000;0",
				['level']=224
			},

			{
				['Reward']="5;1000;0",
				['level']=225
			},

			{
				['Reward']="5;1000;0",
				['level']=226
			},

			{
				['Reward']="5;1000;0",
				['level']=227
			},

			{
				['Reward']="5;1000;0",
				['level']=228
			},

			{
				['Reward']="5;1000;0",
				['level']=229
			},

			{
				['Reward']="5;1000;0",
				['level']=230
			},

			{
				['Reward']="5;1000;0",
				['level']=231
			},

			{
				['Reward']="5;1000;0",
				['level']=232
			},

			{
				['Reward']="5;1000;0",
				['level']=233
			},

			{
				['Reward']="5;1000;0",
				['level']=234
			},

			{
				['Reward']="5;1000;0",
				['level']=235
			},

			{
				['Reward']="5;1000;0",
				['level']=236
			},

			{
				['Reward']="5;1000;0",
				['level']=237
			},

			{
				['Reward']="5;1000;0",
				['level']=238
			},

			{
				['Reward']="5;1000;0",
				['level']=239
			},

			{
				['Reward']="5;1000;0",
				['level']=240
			},

			{
				['Reward']="5;1000;0",
				['level']=241
			},

			{
				['Reward']="5;1000;0",
				['level']=242
			},

			{
				['Reward']="5;1000;0",
				['level']=243
			},

			{
				['Reward']="5;1000;0",
				['level']=244
			},

			{
				['Reward']="5;1000;0",
				['level']=245
			},

			{
				['Reward']="5;1000;0",
				['level']=246
			},

			{
				['Reward']="5;1000;0",
				['level']=247
			},

			{
				['Reward']="5;1000;0",
				['level']=248
			},

			{
				['Reward']="5;1000;0",
				['level']=249
			},

			{
				['Reward']="5;1000;0",
				['level']=250
			},

			{
				['Reward']="5;1000;0",
				['level']=251
			},

			{
				['Reward']="5;1000;0",
				['level']=252
			},

			{
				['Reward']="5;1000;0",
				['level']=253
			},

			{
				['Reward']="5;1000;0",
				['level']=254
			},

			{
				['Reward']="5;1000;0",
				['level']=255
			},

			{
				['Reward']="5;1000;0",
				['level']=256
			},

			{
				['Reward']="5;1000;0",
				['level']=257
			},

			{
				['Reward']="5;1000;0",
				['level']=258
			},

			{
				['Reward']="5;1000;0",
				['level']=259
			},

			{
				['Reward']="5;1000;0",
				['level']=260
			},

			{
				['Reward']="5;1000;0",
				['level']=261
			},

			{
				['Reward']="5;1000;0",
				['level']=262
			},

			{
				['Reward']="5;1000;0",
				['level']=263
			},

			{
				['Reward']="5;1000;0",
				['level']=264
			},

			{
				['Reward']="5;1000;0",
				['level']=265
			},

			{
				['Reward']="5;1000;0",
				['level']=266
			},

			{
				['Reward']="5;1000;0",
				['level']=267
			},

			{
				['Reward']="5;1000;0",
				['level']=268
			},

			{
				['Reward']="5;1000;0",
				['level']=269
			},

			{
				['Reward']="5;1000;0",
				['level']=270
			}
		},
		['ident']=5,
		['castleMapType']=5,
		['name']="农田"
	}
},
['Parameter']=
{
	[1]=
	{
		['CD']=60,
		['ident']=1,
		['desc']="宝箱CD"
	},
	[2]=
	{
		['CD']=1800,
		['ident']=2,
		['desc']="神秘人CD"
	}
},
['param']=
{
	[1]=
	{
		['rate']=100,
		['ident']=1,
		['desc']="1小时时间触发概率"
	},
	[2]=
	{
		['rate']=200,
		['ident']=2,
		['desc']="建筑升级触发概率"
	}
}}
return RandomEvents